[
  {
    "date": "2025-10-27",
    "home_team": "Chicago Bulls",
    "away_team": "Atlanta Hawks",
    "home_points": 128,
    "away_points": 123,
    "score": "Chicago Bulls 128 - 123 Atlanta Hawks",
    "winner": "Chicago Bulls",
    "articles": [
      {
        "uri": "8928429822",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2025-10-28",
        "time": "03:20:35",
        "dateTime": "2025-10-28T03:20:35Z",
        "dateTimePub": "2025-10-28T02:59:21Z",
        "dataType": "news",
        "sim": 0.6627451181411743,
        "url": "https://www.yakimaherald.com/ap/sports/dosunmu-scores-21-points-to-lead-bulls-to-128-123-win-over-hawks/article_877471ad-e1aa-54ee-b778-ba2597ce6bcf.html",
        "title": "Dosunmu scores 21 points to lead Bulls to 128-123 win over Hawks",
        "body": "CHICAGO (AP) -- Ayo Dosunmu scored 21 points, Josh Giddey had 18 points and 13 rebounds and the Chicago Bulls rallied to top the Atlanta Hawks 128-123 on Monday night.\n\nNikola Vucevic had 17 points and 17 rebounds as Chicago came back from an early 13-point deficit to improved to 3-0, its best start in four years.\n\nKristaps Porzingis scored 27 points and Jalen Johnson 15 added in their return to the the Hawks lineup, but Atlanta dropped its second straight and the first of a four game trip to fall to 1-3.\n\nTrae Young had 21 points and 17 assists, including some flashy setups. Onyeka Okongwu added 18 points and 10 rebounds.\n\nEight Chicago players, including all five starers, reached double figures in scoring. Matas Buzelis had 16 points and Tre Jones added 14 with nine assists.\n\nBuzelis hit a 3 with with 2:30 left to put Chicago ahead 121-118, and Kevin Huerter upped it to a five-point lead on a running layup off Vucevic's steal 13 seconds later. Giddey iced it with a pair of free throw with 7.7 seconds left.\n\nChicago trailed 58-57 at the half. The Bulls changed the tone of the game with a high-tempo third quarter when they outscored Atlanta 41-34 and extended their lead to as much as 11 points.\n\nThen the Hawks replied with a 9-2 run to open the fourth quarter and jump ahead 101-100. That set up a back-and forth finish in game with 15 lead changes.\n\nJump start your day.\n\nHeadlines, puzzles and death notices from the Valley delivered to your inbox 7 a.m. daily.\n\nSign Up\n\nPorzingis had missed two games with flu-like symptoms and Johnson missed one with an ankle sprain. They were joined in Atlanta's starting linup by Zaccharie Risacher, who had missed two games with an ankle sprain.\n\nThe Bulls took a 60-58 lead 24 seconds into the third on Isaac Okoro's 3 pointer to start the scoring flurry in the quarter.\n\nPorzingis scored his first 10 points in the opening 3:58.\n\nUp next\n\nHawks: At Brooklyn on Wednesday.\n\nBulls: Host Sacramento on Wednesday.\n\nAP NBA: https://www.apnews.com/hub/NBA",
        "source": {
          "uri": "yakimaherald.com",
          "dataType": "news",
          "title": "Yakima Herald-Republic"
        },
        "authors": [
          {
            "uri": "associated_press@yakimaherald.com",
            "name": "Associated Press",
            "type": "author",
            "isAgency": true
          },
          {
            "uri": "matt_carlson@yakimaherald.com",
            "name": "Matt Carlson",
            "type": "author",
            "isAgency": false
          }
        ],
        "image": "https://bloximages.newyork1.vip.townnews.com/yakimaherald.com/content/tncms/assets/v3/editorial/d/83/d83eb243-1106-5c6f-840b-61287b4bc584/690033aa07289.image.jpg?crop=1763%2C926%2C0%2C124&resize=438%2C230&order=crop%2Cresize",
        "eventUri": "eng-11086884",
        "sentiment": 0.1294117647058823,
        "wgt": 128,
        "relevance": 128
      }
    ]
  },
  {
    "date": "2025-10-27",
    "home_team": "Dallas Mavericks",
    "away_team": "Oklahoma City Thunder",
    "home_points": 94,
    "away_points": 101,
    "score": "Dallas Mavericks 94 - 101 Oklahoma City Thunder",
    "winner": "Oklahoma City Thunder",
    "articles": [
      {
        "uri": "8928489718",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2025-10-28",
        "time": "04:29:58",
        "dateTime": "2025-10-28T04:29:58Z",
        "dateTimePub": "2025-10-28T04:00:48Z",
        "dataType": "news",
        "sim": 0.7254902124404907,
        "url": "https://www.news-gazette.com/mavericks-mount-furious-comeback-vs-thunder-but-fall-short-as-offensive-woes-persist/article_8a33bd14-594d-5e71-bc95-2ba1b04b8752.html",
        "title": "Mavericks mount furious comeback vs. Thunder but fall short as offensive woes persist",
        "body": "DALLAS -- The Dallas Mavericks received a big break when the NBA's schedule-makers gifted them with five straight home games to start the 2025-26 season.\n\nThat's where the grace stopped.\n\nThe Mavericks' first set of back-to-back games included a visit from the Oklahoma City Thunder, which entered the first meeting of the season as one of four remaining undefeated teams.\n\nAfter claiming their first win of the season one night before, the Mavericks suffered a heartbreaking 101-94 loss to the Thunder despite a valiant comeback effort.\n\nDallas trailed by as many as 22, but went on an electric 25-4 run in the fourth quarter to cut the deficit to one point following a floater by D'Angelo Russell.\n\nThe Mavericks trailed by three points with 33 seconds remaining when Russell missed a contested 3-pointer with 15 seconds remaining on the shot clock. The ball grazed the front of the rim and Chet Holmgren grabbed the rebound until PJ Washington swiped the ball down, which went out of bounds off of the Mavericks forward's foot. Mavericks coach Jason Kidd challenged the call, but was unsuccessful.\n\nThe game was placed out of reach one play later when Shai Gilgeous-Alexander was fouled and sent to the free throw line. His two freebies marked the end of the Mavericks' hopes to upset the defending champions.\n\nOklahoma City has had its fair share of close games, with both of its first two games against Houston and Indiana needing double overtime to decide a winner.\n\nBoth teams were shorthanded, but Dallas was noticeably thinner, especially in the frontcourt. Dereck Lively II and Daniel Gafford were sidelined with injuries, which prompted Jason Kidd to use a new starting lineup. Max Christie was the next man up, joining Cooper Flagg, Klay Thompson, Washington and Anthony Davis in the first unit.\n\nHowever, the first play of the game had lasting ramifications as Flagg collided with Thunder center Isaiah Hartenstein, leading to discomfort in his left arm. Coming off the best game of his young career the night before, Flagg struggled with just two points, two rebounds and two steals. He favored his left arm throughout the first half and his only score was a contested floater over Holmgren, Aaron Wiggins and Jaylin Williams.\n\nIt was apparent that Flagg's left arm was bothering him when he was spotted several times with his shoulder wrapped during timeouts in the second half.\n\nAside from Flagg's off night, the Mavericks were abysmal on both ends of the floor. They shot 37.9% from the field, 30.8% from beyond the arc and 72.7% from the stripe. Dallas made progress with its turnover issue, only coughing the ball up nine times. However, it couldn't manufacture enough offense to compete with the Thunder until its 25-point fourth quarter.\n\nDavis, who started at center, led the Mavericks with 26 points, 11 rebounds and three assists. He scored a transition layup as he was fouled that brought the Mavericks within three with 1:25 left. The play was sparked by Washington's block on Gilgeous-Alexander.\n\nPJ Washington blocked SGA's floater, which led to a fast break and Davis got an and-one on the other end.\n\nWashington added 15 points and tied a season-high nine rebounds. Christie performed well in his first start of the season with 14 points, knocking down 4 of 8 shots from beyond the arc.\n\nGilgeous-Alexander led Oklahoma City with 23 points, four rebounds and eight assists. Holmgren, who was initially listed as questionable with low back soreness, had 18 points, 11 rebounds and four blocks. His viral moment occurred early in the third quarter when he pumpfaked PJ Washington into the air, drove to the basket and threw down a one-handed slam over Flagg with authority.\n\nHartenstein also took advantage of Dallas' thin frontcourt and recorded a double-double of 16 points and 12 rebounds.\n\nOklahoma City played without Jalen Williams and Alex Caruso, while the Mavericks were without Lively, Gafford, Brandon Williams, Dante Exum and Kyrie Irving.\n\nThe Mavericks will conclude their five-game homestand with a game against the defending Eastern Conference champions, as the Pacers visit American Airlines Center on Wednesday.\n\n©2025 The Dallas Morning News. Distributed by Tribune Content Agency, LLC.",
        "source": {
          "uri": "news-gazette.com",
          "dataType": "news",
          "title": "The News-Gazette"
        },
        "authors": [],
        "image": "https://bloximages.newyork1.vip.townnews.com/news-gazette.com/content/tncms/custom/image/e462f33a-3c65-11ec-b3f1-2f038a8f66b4.jpg?resize=600%2C315",
        "eventUri": "eng-11088941",
        "sentiment": -0.01960784313725494,
        "wgt": 177,
        "relevance": 177
      },
      {
        "uri": "8928541155",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2025-10-28",
        "time": "05:26:16",
        "dateTime": "2025-10-28T05:26:16Z",
        "dateTimePub": "2025-10-28T05:18:24Z",
        "dataType": "news",
        "sim": 0.9019607901573181,
        "url": "https://www.whas11.com/article/syndication/associatedpress/cooper-flaggs-first-nba-back-to-back-missed-shots-and-banged-up-shoulder/616-9cae1a49-3567-43fb-87bb-51fdeb825890",
        "title": "Cooper Flagg's first NBA back-to-back: missed shots and banged-up shoulder",
        "body": "DALLAS(AP) -- Cooper Flagg's first experience with an NBA back-to-back was a painful one.\n\nThe No. 1 draft pick by the Dallas Mavericks barely got through the opening seconds of the second game Monday night before hurting his left shoulder. Flagg held the shoulder multiple times during the first half, used a heat wrap on it while on the bench during the second half and struggled through a 1-for-9 shooting night for two points, missing all three of his 3-pointers.\n\nFlagg played 31 minutes but was watching from the bench during most of the Mavericks' late rally, as they cut a 22-point, second-half deficit against the defending champion Oklahoma City Thunder to one point in the final minute but lost 101-94.\n\n\"Just being a little flat, a little banged up. I've got to find ways to play through it,\" Flagg said while seated at his locker with an ice pack on the shoulder. He said the shoulder will be scanned Tuesday and he expects to play in Dallas' next game, Wednesday at home against Indiana.\n\nThe 6-foot-9 guard from Duke said he doesn't know how he got hurt, just that it was in the game's opening minute when he was trying to box out and felt something move.\n\n\"Just a little contact. Can't remember if a guy like, grabbed,\" Flagg said. \"It was somebody's arm. I just like felt something in my shoulder, a little pain after.\"\n\nFlagg shot 1 for 6 in the first half, scoring on a layup midway through the second period.\n\n\"He played through it,\" Mavericks coach Jason Kidd said. \"He's a tough kid.\"\n\nWatching down the stretch was unusual for Flagg after he was on the floor in crunch time last season as the national player of the year in his one season with the Blue Devils.\n\n\"I mean, the way the game was going, we had a group there that was doing really well,\" Flagg said. \"I see where Coach was at with that. I was flat. I wasn't myself. I wasn't having an impact on the game at a high level. Wasn't doing the right stuff.\"\n\nThe two-point night left Flagg averaging 13 points four games into his pro career, with a high of 22 in Sunday night's home win over Toronto.\n\nDallas' next back-to-back will be Nov. 7-8 at Memphis and Washington.\n\n\"It is different, but I've got to figure it out,\" Flagg said. \"I'm not too worried about it.\"",
        "source": {
          "uri": "whas11.com",
          "dataType": "news",
          "title": "WHAS 11 Louisville"
        },
        "authors": [],
        "image": "https://media.whas11.com/assets/AssociatedPress/images/ab50baaf-5fa0-4703-88ea-612d3569d619/20251028T052018/ab50baaf-5fa0-4703-88ea-612d3569d619_1140x641.jpg",
        "eventUri": "eng-11091126",
        "sentiment": -0.1529411764705882,
        "wgt": 152,
        "relevance": 152
      }
    ]
  },
  {
    "date": "2025-10-27",
    "home_team": "Detroit Pistons",
    "away_team": "Cleveland Cavaliers",
    "home_points": 95,
    "away_points": 116,
    "score": "Detroit Pistons 95 - 116 Cleveland Cavaliers",
    "winner": "Cleveland Cavaliers",
    "articles": [
      {
        "uri": "8929157465",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2025-10-28",
        "time": "12:44:38",
        "dateTime": "2025-10-28T12:44:38Z",
        "dateTimePub": "2025-10-28T12:38:42Z",
        "dataType": "news",
        "sim": 0.6941176652908325,
        "url": "https://www.nytimes.com/athletic/6755998/2025/10/28/pistons-loss-offense-cavs/",
        "title": "Pistons still searching for offensive flow after blowout loss to Cavaliers",
        "body": "DETROIT -- Pockets of fans throughout Little Caesars Arena began their trek to the exits just a few minutes into the fourth quarter on Monday.\n\nThey'd watched the Detroit Pistons compile more fouls than made field goals and fewer assists than turnovers through the first three periods. The collective sense of restlessness throughout the arena was warranted on a night in which the Pistons were outclassed by the Cleveland Cavaliers. Sure, Detroit was on the second night of back-to-back games, but so was Cleveland.\n\nThe Cavaliers showed why they're one of the Eastern Conference's elites. The Pistons' performance, on the other hand, suggested they're still looking to establish the foundation of who they are this season. Detroit described its previous two victories as \"identity wins\" but failed to pass the litmus test Cleveland presented in a 116-95 loss.\n\nPistons coach J.B. Bickerstaff said his team is still in the process of \"learning each other,\" which has contributed to how stagnant the half-court offense has looked through the first four games.\n\n\"I'm not opposed to the shots that we're getting,\" Bickerstaff said when asked about Detroit's shot quality. \"It is a bit of a different group out there that's playing together. We're learning the triggers, how we create rotations, put advantage situations (together). It'll smooth out. It's been choppy at times, for sure. You're not seeing that wrong.\n\n\"But again, just (need) more time together, more reps at it. ... We're trying to make this our climb. So, we've got a starting point that we're at right now, and then we'll continue to figure it out and get better.\"\n\nIsaiah Stewart gave the Pistons a 23-22 lead with 4:01 remaining in the first quarter. Detroit didn't score its next field goal until a Duncan Robinson layup with 5:01 left in the first half. The Pistons' offense stalled for 11 minutes of game time, during which they missed 19 consecutive field goals and allowed the Cavaliers to go on a 25-3 run before Robinson put an end to it.\n\nA Jalen Duren free throw and a pair of Cade Cunningham free throws were the only Detroit points generated during that span before Robinson's layup. As suffocating as Cleveland's defense was, dry spells of that length aren't tolerable for a team seeking to take the next step in its progression.\n\nEach of the 19 misses seemed to suck the life out of the building. The Pistons ended the second quarter shooting 5 of 24 overall and 2 of 11 from distance. They had five turnovers to four assists and were never able to recover.\n\n\"We should never let go of the rope like that,\" Robinson said. \"But there's going to be a feeling-out process, particularly offensively, trying to get it right and figured out.\"\n\nDetroit, through its first four games, is shooting 42.8 percent from the field and 32.8 percent from 3-point range. The Pistons rank 27th in the NBA in field-goal percentage and 24th in 3-point percentage.\n\nThe Pistons had far too many possessions during their stretch without a field goal with little to no movement. The Cavaliers' defense loaded up on Cunningham to contest the majority of his looks. But Detroit was ultimately unable to string together consistent movement necessary to find its way out of that slump.\n\nThe Pistons' inability to value possessions and take care of the ball has factored into their scoring struggles as well. Their 1.39 assist-to-turnover ratio ranks 26th and was on full display Monday. Cunningham had five turnovers to his four assists in the loss and shot just 3 of 14 from the field for 12 points.\n\nIt was the most out of sorts he's looked thus far this season, and his frustration was evident. Cunningham spoke Sunday night after the Pistons' win over the Boston Celtics about the way teams have been defending him a year removed from his first All-Star selection.\n\n\"It's not anything I didn't expect to happen,\" Cunningham said. \"I just don't feel like I've handled it the way I've wanted to. So, I'm going to keep watching the film and try to be better for my team. I feel like we had a lot of empty offensive possessions because I just didn't handle the (double-teams) and get the ball out of my hands cleanly.\n\n\"I'm going to learn from it and keep getting better.\"\n\nCunningham is acutely aware of the challenges he's faced to start the season and seems committed to making the adjustments needed to put his team in more advantageous situations offensively. Although he's averaging 20.3 points, 7.8 assists and 5.5 rebounds per game, he's shooting 36.1 percent, 26.9 percent from 3 and posting 5.5 turnovers.\n\nBickerstaff put the onus on himself when discussing how to aid Cunningham in overcoming these early growing pains.\n\n\"They've got a ton of size, and they do a great job of shrinking the floor and make you play in crowded spaces,\" Bickerstaff said of Cleveland's defensive scheme. \"I've got to do a better job of helping him in those situations, creating more space for him in those situations. But again, we're early in the season. We'll continue to build from it.\"\n\nWhile it is early in the season, and Detroit has yet to play at full strength, its offense will need to find its stride soon if it hopes to take a leap in the Eastern Conference. The Pistons' next opportunity to do so comes Wednesday, as they host the Orlando Magic.",
        "source": {
          "uri": "nytimes.com",
          "dataType": "news",
          "title": "The New York Times"
        },
        "authors": [
          {
            "uri": "hunter_patterson@nytimes.com",
            "name": "Hunter Patterson",
            "type": "author",
            "isAgency": false
          }
        ],
        "image": "https://static01.nyt.com/athletic/uploads/wp/2025/10/28073832/cavs-scaled.jpeg?width=1200&height=630&fit=cover",
        "eventUri": "eng-11088026",
        "sentiment": -0.04313725490196074,
        "wgt": 226,
        "relevance": 226
      },
      {
        "uri": "8928995533",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2025-10-28",
        "time": "11:02:07",
        "dateTime": "2025-10-28T11:02:07Z",
        "dateTimePub": "2025-10-28T11:01:30Z",
        "dataType": "news",
        "sim": 0.5137255191802979,
        "url": "https://www.cleveland.com/cavs/2025/10/wine-and-gold-podcast-individual-story-headline.html",
        "title": "The second star blueprint: How one player could unlock both the Cavs and Pistons' path to contention",
        "body": "CLEVELAND, Ohio -- In the modern NBA, the formula for contention is clear: every serious playoff team needs at least two stars. One can carry a team to the postseason, but it takes two to stay there.\n\nThe Cavs and Detroit Pistons are both trying to solve that equation.\n\nFor the Cavs, the focus is on Evan Mobley -- the gifted 24-year-old big man they believe can grow into the perfect complement to Donovan Mitchell.\n\nFor the Pistons, the search centers on Ausar Thompson, the dynamic, defense-first forward who could be the ideal running mate for Cade Cunningham.\n\nBoth franchises are chasing the same elusive breakthrough: consistency from their young cornerstone that transforms them from competitive to contending.\n\nOn the latest episode of the Wine and Gold Talk podcast following Detroit's lopsided 116-95 loss to the Cavaliers, Detroit Free Press Pistons reporter Omari Sankofa II identified Thompson as the linchpin for the Pistons' playoff aspirations.\n\n\"I think Asar Thompson is the key to a lot of that. Just a guy with his athleticism, like his innate gifts,\" Sankofa explained. \"He's somebody, I think around the league people are pretty bullish on having a chance at being in the Most Improved Player of the Year conversation, he and his brother.\"\n\nThompson struggled against Cleveland, scoring just six points in 15 minutes while battling foul trouble. But Sankofa's assessment looks beyond one difficult night to the bigger picture of what Thompson could become for Detroit. His development trajectory could potentially transform the Pistons from a plucky young team into a legitimate threat in the East.\n\n\"If he's that second star on some level, then I think that puts you a lot closer to contention where, you know, every contending team now has at least two go-to guys,\" Sankofa said.\n\nThat sentiment would sound familiar in Cleveland's locker room.\n\nThe Cavaliers are living a parallel storyline with Mobley -- the former No. 3 pick who's already an Defensive Player of the Year, All-Star and All-NBA second team forward but still is developing into an offensive centerpiece.\n\nUnder Kenny Atkinson, Cleveland is trying to empower Mobley to become their second reliable option next to Mitchell, the same way Detroit hopes Thompson can emerge alongside Cunningham.\n\nFor both teams, the next leap is about skill refinement and confidence. The Cavs want Mobley to be assertive, to make reads quicker, and to turn defensive dominance into transition opportunities. The Pistons need Thompson to channel his explosiveness into offensive production without losing the defensive edge that makes him special.\n\nWhat makes Thompson's development particularly critical is the context surrounding the Pistons' front office. Most of the current roster wasn't drafted by general manager Trajan Langdon, meaning this season serves as an evaluation period to determine which pieces truly fit the team's future plans.\n\n\"He is, I think in evaluation mode still, you know, especially for a guy like Ausar who, you know, came back from blood clots last year and played himself back into shape,\" Sankofa noted.\n\nDetroit's trajectory mirrors what Cleveland experienced just a few seasons ago -- a young team on the rise, looking for proof that its potential can translate to postseason success. The Pistons' dramatic improvement, jumping from 14 wins to 44 wins and pushing the Knicks to six games in the playoffs -- has created expectations for continued growth. But that growth may ultimately hinge on Thompson's ability to become more than just an elite defender and develop into a consistent offensive threat.\n\nBeyond Thompson, Sankofa also identified 21-year-old center Jalen Duren as another key piece with significant upside.\n\n\"He's also a guy that I think can eventually step into a bigger role, especially if he can improve his rim protection and operating in drop but still being able to contest 3s and some of the finer nuances of the defensive aspect of the game,\" he said.\n\nFor Detroit, this season is about answering fundamental questions about their core: Can Thompson develop into that coveted second star? Will Duren continue his developmental trajectory? And perhaps most importantly, does this group have the ceiling to eventually challenge the Eastern Conference elite -- teams like Cleveland, who are already navigating that same test?\n\nMobley's growth in Cleveland and Thompson's rise in Detroit may end up defining how far each team can go. Both are rare defensive talents with the chance to reshape their franchises' futures. The blueprint is there -- now, it's about who can execute it first.\n\nWant to hear Omari Sankofa II and host Ethan Sands' full breakdown of the Pistons' potential and Thompson's pivotal role? Check out the complete episode of the Wine and Gold Talk podcast for expert analysis on Detroit's path forward.",
        "source": {
          "uri": "cleveland.com",
          "dataType": "news",
          "title": "Cleveland"
        },
        "authors": [],
        "image": "https://www.cleveland.com/resizer/v2/S3TGGMLGYVDL7DRALVTESOPHMI.jpg?auth=2f01bf1c41aef4ff75c05a07ce0c0e5d95c855e167f224fd25ee3e58411fb875&width=1280&smart=true&quality=90",
        "eventUri": "eng-11088026",
        "sentiment": 0.3411764705882352,
        "wgt": 201,
        "relevance": 201
      },
      {
        "uri": "b-8928397334",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2025-10-28",
        "time": "02:30:52",
        "dateTime": "2025-10-28T02:30:52Z",
        "dateTimePub": "2025-10-28T02:20:51Z",
        "dataType": "blog",
        "sim": 0,
        "url": "https://www.swoknews.com/coronavirus/pistons-miss-19-straight-shots-in-blowout-loss-to-cavaliers/article_b9490d6c-c1fb-59b3-be29-663c8d3855d5.html",
        "title": "Pistons miss 19 straight shots in blowout loss to Cavaliers",
        "body": "DETROIT -- Jalen Duren approached the free-throw line at the 3:27 mark of the first quarter. The Detroit Pistons had overcome a rough start earlier in the quarter, and after Duren made 1 of 2 free throws, the Pistons held a 24-22 lead over the Cleveland Cavaliers.\n\nHowever, over the next 10 minutes, the Pistons missed 19 consecutive shots. While they struggled to find the basket, the Cavaliers went on a dominant 25-2 run, leading to a 116-95 Pistons' loss on Monday at Little Caesars Arena.\n\nkAms6DA:E6 2 C@F89 ?:89E[ r256 rF??:?892> =65 s6EC@:E H:E9 'a A@:?ED @? b\\@7\\'c D9@@E:?8[ ' @7 f 7C@> 566A[ H:E9 7:G6 EFC?@G6CD] #@? w@==2?5 xx 25565 '' A@:?ED 2?5 7@FC C63@F?5D] u:G6 A=2J6CD D4@C65 :? 5@F3=6 7:8FC6D 7@C E96 r2G2=:6CD[ H:E9 s@?@G2? |:E496== =625:?8 E96 H2J H:E9 2 82>6\\9:89 bd A@:?ED]k^Amk9C ^mkAmU4@AJja_ad k2 9C67lQ9EEAi^^HHH]56EC@:E?6HD]4@>QmHHH]56EC@:E?6HD]4@>k^2m] ':D:E 2E k2 9C67lQ9EEADi^^HHH]56EC@:E?6HD]4@>Qm56EC@:E?6HD]4@>k^2m] s:DEC:3FE65 3J %C:3F?6 r@?E6?E p86?4J[ {{r]k^Am",
        "source": {
          "uri": "swoknews.com",
          "dataType": "blog",
          "title": "The Lawton Constitution"
        },
        "authors": [],
        "image": null,
        "eventUri": null,
        "sentiment": -0.03529411764705881,
        "wgt": 201,
        "relevance": 201
      }
    ]
  },
  {
    "date": "2025-10-27",
    "home_team": "Golden State Warriors",
    "away_team": "Memphis Grizzlies",
    "home_points": 131,
    "away_points": 115,
    "score": "Golden State Warriors 131 - 115 Memphis Grizzlies",
    "winner": "Golden State Warriors",
    "articles": [
      {
        "uri": "8928540198",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2025-10-28",
        "time": "05:24:24",
        "dateTime": "2025-10-28T05:24:24Z",
        "dateTimePub": "2025-10-28T04:54:56Z",
        "dataType": "news",
        "sim": 0.7333333492279053,
        "url": "https://www.nbcbayarea.com/nba/golden-state-warriors/jonathan-kuminga-win-grizzlies/3971137/",
        "title": "What we learned as Jonathan Kuminga leads Warriors to dominant, bounce-back win over Grizzlies",
        "body": "SAN FRANCISCO - Three days after a humbling trip to the Pacific Northwest, the Warriors returned to the Bay Area and got things back on the right track.\n\nPaced by another strong game from Jimmy Butler III and another step forward in the evolution of Jonathan Kuminga, Golden State had the Chase Center crowd rocking for most of the night as the Warriors put it on the Memphis Grizzlies, beating Ja Morant and Co. 131-118 on Monday night.\n\nThough he didn't get to the free-throw line as often as he had in the Warriors' first three games, Butler still proved to be a thorn in the Grizzlies side with 20 points, five rebounds and five assists.\n\nKuminga had his best game of the young season with a game-high 25 points and 10 rebounds. Stephen Curry scored 16 points, Brandin Podziemski had 23 points and six assists, Moses Moody had 18 with five threes while Draymond Green scored only seven points but tallied 10 assists.\n\nThe Warriors (3-1) had this one from start to finish, leading by 21 at one point.\n\nThe timing couldn't have been better, too.\n\nPlaying the first half of a back-to-back and winning handily allowed Warriors coach Steve Kerr to give Curry some rest before Tuesday's game against the Los Angeles Clippers. The 3-point king had been averaging more than 32 minutes in each of Golden State's first three games but logged just under 30 minutes against Memphis. At 37 years old, the two-time NBA MVP will take whatever break he can get.\n\nThis one was over early.\n\nThe Warriors opened the game with a 7-0 run and never looked back. Memphis didn't go away quiety and made multiple runs to get close, but the Grizzlies never could get over the hump.\n\nThe game took on a lighthearted moment late in the third quarter when Green was hit with a Flagrant 1 foul after he fouled Memphis' Santi Aldama.\n\nGreen, of course, protested the call though it held up. When Aldama missed both free throws, Green high-stepped and danced through the key.\n\nHere are the takeaways from Monday's win:\n\nThough they hardly ever matched up against one another, the showdown between Curry and Morant was the marquee story heading into the night, and the two fully lived up to the hype.\n\nMorant got the upper hand as far as stats go, with 23 points and nine assists.\n\nBoth men continue to play at a high level. Morant repeatedly attacked the rim while Curry roamed around the perimeter and did what he always does behind the arc.\n\nWhile Morant got the stats, Curry got the W which is much more important. He's now 7-4 in games against Morant including the playoffs.\n\nThe 2025-26 NBA season is only four games old, but Kuminga appears as to have a new, controlled approach on the floor.\n\nWhile still fashioning himself as a player with a steady jumper, Kuminga is being more selective about what shots he takes from the perimeter. At the same time, his patented power drives down the lane look a lot more polished. He also dished out four assists.\n\nDuring one stretch in the first quarter Kuminga started to drive baseline, hesitated as defenders slid over then dropped the ball through for the easy score.\n\nKuminga also did an admirable job when he tried to defend Morant. With four inches in height difference, the pairing alone had a comical look, though Kuminga was all business and stuck tight to the Grizzlies point guard.\n\nOne of the big issues for the Warriors in Friday's loss to the Portland Trail Blazers was their inability to protect the ball. They committed a season-high 25 turnovers, which repeatedly prevented the offense from finding much of a rhythm.\n\nAgainst the Grizzlies the Warriors continued to have some sloppy stretches, and they coughed up the ball 15 times that led to 20 points for Memphis. That's still far too many for Kerr, but it is a step in the right direction.\n\nAs wild as it seems, the Warriors have had serious turnover issuers ever since Curry entered the NBA. The good thing, however, is that for the most part they've been able to overcome all those mistakes.\n\nThis will likely be a storyline for Kerr's team all season.",
        "source": {
          "uri": "nbcbayarea.com",
          "dataType": "news",
          "title": "NBC Bay Area"
        },
        "authors": [],
        "image": "https://media.nbcbayarea.com/2025/10/jonathan-kuminga-GettyImages-2243711799-e1761626295584.jpg?quality=85&strip=all&resize=1200%2C675",
        "eventUri": "eng-11090221",
        "sentiment": 0.08235294117647052,
        "wgt": 226,
        "relevance": 226
      },
      {
        "uri": "8928507004",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2025-10-28",
        "time": "04:49:32",
        "dateTime": "2025-10-28T04:49:32Z",
        "dateTimePub": "2025-10-27T21:41:00Z",
        "dataType": "news",
        "sim": 0.6627451181411743,
        "url": "https://www.chicoer.com/2025/10/27/warriors-prove-they-can-win-at-less-than-full-strength-with-well-rounded-effort-vs-grizzlies/",
        "title": "Warriors prove they can win at less than full strength with well-rounded effort vs. Grizzlies",
        "body": "SAN FRANCISCO -- The reality of the Warriors' roster means that, on nights one or more of their veteran stars gets a breather, their ability to win at less than full strength will play an imperative role in determining their position when the postseason comes around.\n\nGolden State has looked mighty good when everyone is available, and on Monday night, the Warriors (3-1) notched their first win while missing a key piece.\n\nMoses Moody heated up after halftime to score 20 points off the bench, while Jonathan Kuminga led four Golden State starters to finish in double figures, as the Warriors dispatched of the Memphis Grizzlies, 131-118. All the while, Al Horford watched from the bench in a beige sweatsuit.\n\nThe supporting cast delivered a better effort than on Friday in Portland, the Warriors' first game without the 39-year-old Horford, which ended in a 139-119 loss despite getting 42 points from Steph Curry. The Warriors required only 16 points from Curry against the Grizzlies (2-2), his lowest scoring output of the young season.\n\nKuminga continued to fill the stat sheet with a 25-point, 10-rebound double-double. Brandin Podziemski poured in 20 points and six assists -- both season highs -- and Jimmy Butler contributed 20 points, five rebounds and five assists. Draymond Green, the lone starter who didn't score in double figures, led the team with 10 assists.\n\nAfter going big against the Blazers with Quinten Post as their fifth starter in place of Horford, Kerr opted to reinsert Podziemski into the starting lineup and was quickly rewarded. Podziemski sank an open 3-pointer on the Warriors' first possession, assisted to Curry in transition and eventually finishing with double the amount of dimes that he had totaled his first three games (three).\n\nThe Warriors assisted on 25 of their 31 baskets, including six from Draymond Green by the 6-minute mark of the first period as Golden State built a 25-15 advantage. The Grizzlies, however, mounted a 16-0 run against the Warriors' reserves and ended the opening quarter leading 37-36.\n\nThe Warriors' 36 points -- which they also equaled in the third quarter -- were the most they have scored in a quarter this season, but the 37 they allowed trailed only their worst defensive periods against Denver and Portland. The group buckled down to hold the Grizzlies to 8-of-24 from the field in the second quarter to go into halftime up 65-61 and limited Memphis to under 40% shooting from the end of the first onward.\n\nThe starting unit again built a 10-point lead during their shift early following halftime. This time, when Kerr went to his bench, the reserves didn't let the lead evaporate -- they built on it, led by Moody. The fifth-year shooting guard, who missed the first two games of the season with a calf strain, was a team-worst minus-12 at halftime but proceeded to make that up and more after intermission.\n\nMoody entered the game with the Warriors leading by seven and connected on consecutive 3-pointers to push their advantage to 13, 88-75. He swiped the ball from Memphis big man Santi Aldama, passed to Curry and called for the ball back on the perimeter. Jaren Jackson Jr. fouled him attempting to contest the shot, and Moody sank all three free throws to push the Warriors' lead back to 16.\n\nThe sequence ignited the arena to its loudest point of the night, aided by none other than Curry and Green. Curry flexed and summoned the 18,064 on hand to rise to their feet as Moody headed to the line. A possession earlier, Green began to incite the crowd after his hard foul on Aldama was upgraded to a Flagrant 1.\n\nAldama missed both free throws he was awarded, and Green celebrated by skipping around the paint as if he was riding a toy horse.\n\nThe Warriors will be back at full strength for the second half of their second back-to-back of the season as Horford is expected to return for their matchup against the Los Angeles Clippers. Tipoff at Chase Center is set for 8 p.m. in the first of a new era of some later starts.",
        "source": {
          "uri": "chicoer.com",
          "dataType": "news",
          "title": "Chico Enterprise-Record"
        },
        "authors": [
          {
            "uri": "evan_webeck@chicoer.com",
            "name": "Evan Webeck",
            "type": "author",
            "isAgency": false
          }
        ],
        "image": "https://www.chicoer.com/wp-content/uploads/2025/10/BNG-L-WARRIORS-1028-12.jpg?w=640",
        "eventUri": "eng-11084096",
        "sentiment": 0.1058823529411765,
        "wgt": 226,
        "relevance": 226
      }
    ]
  },
  {
    "date": "2025-10-27",
    "home_team": "Houston Rockets",
    "away_team": "Brooklyn Nets",
    "home_points": 137,
    "away_points": 109,
    "score": "Houston Rockets 137 - 109 Brooklyn Nets",
    "winner": "Houston Rockets",
    "articles": [
      {
        "uri": "8928407885",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2025-10-28",
        "time": "02:45:57",
        "dateTime": "2025-10-28T02:45:57Z",
        "dateTimePub": "2025-10-28T02:38:40Z",
        "dataType": "news",
        "sim": 0.7137255072593689,
        "url": "https://medicinehatnews.com/sports/national-sports/2025/10/27/rockets-rout-the-winless-nets-137-109-for-their-first-victory-of-the-season/",
        "title": "Rockets rout the winless Nets 137-109 for their first victory of the season - Medicine Hat News",
        "body": "HOUSTON (AP) -- Tari Eason scored 22 points, Alperen Sengun added 21 points, six rebounds and six assists, and the Houston Rockets beat the Brooklyn Nets 137-109 on Monday night for their first victory of the season. Kevin Durant had 19 points against his former team, which fell to 0-4. Eason made five 3-pointers off the bench and fellow reserve Reed Sheppard added 15 points and eight assists. Houston lost in two overtimes against Oklahoma City in the NBA season opener and then fell by four against Detroit in its second game, but this one was never close. The Rockets led 42-25 after shooting 62.5% in the first quarter, then outscored the Nets 32-17 in the third to extend an 11-point halftime lead to 103-77. The lead grew to 33 points in the fourth quarter. Amen Thompson had 12 points and eight assists. Terance Mann scored 21 points and Michael Porter Jr. had 18 for the Nets, who lost in San Antonio a day earlier and had little energy Monday. Day'Ron Sharpe came off the bench for 17 points and 12 rebounds. Cam Thomas, who scored 40 points Sunday, was limited to nine. Up next Nets: Host Atlanta on Wednesday. Rockets: Host Toronto on Wednesday. ___ AP NBA:",
        "source": {
          "uri": "medicinehatnews.com",
          "dataType": "news",
          "title": "Medicine Hat News"
        },
        "authors": [
          {
            "uri": "canadian_press@medicinehatnews.com",
            "name": "Canadian Press",
            "type": "author",
            "isAgency": false
          }
        ],
        "image": "https://medicinehatnews.com/wp-content/uploads/2022/05/medicinehatnewslogo-square.jpg",
        "eventUri": "eng-11089173",
        "sentiment": -0.03529411764705881,
        "wgt": 128,
        "relevance": 128
      },
      {
        "uri": "8928397721",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2025-10-28",
        "time": "02:31:03",
        "dateTime": "2025-10-28T02:31:03Z",
        "dateTimePub": "2025-10-28T02:30:28Z",
        "dataType": "news",
        "sim": 0.6627451181411743,
        "url": "https://www.click2houston.com/news/local/2025/10/28/eason-takes-over-in-first-half-as-rockets-topple-nets-137-109-in-first-win-of-kd-era/",
        "title": "Eason takes over in first half as Rockets topple Nets 137-109 in first win of KD era",
        "body": "HOUSTON - After coming up on the wrong end of nail-biters in their first two games of the season, the Houston Rockets were anxious to get one in the W column.\n\nThey did just that Monday night, blowing out the Brooklyn Nets, 137-109.\n\nRecommended Videos\n\nTari Eason led the Rockets in scoring, finishing with 22 points. He scored 20 in the first half, knocking down five of his first six three-pointers to provide some much needed offense off the bench.\n\nDurant also had a strong showing, scoring 19 points despite sitting for most of the second half because of the team's massive lead on the scoreboard.\n\nTerance Mann led the Nets in scoring, finishing with 21.\n\nThe teams went back-and-forth from the opening tip, until Houston forced some separation in the latter half of the opening quarter. After Brooklyn's Day'Ron Sharpe brought the Nets within two points, the Rockets ended the period with 15 straight points. Houston's Tari Eason knocked down back-to-back threes as the Rockets led 42-25 after the first.\n\nThe Nets fought back in the second quarter, but the Rockets did their part on offense to keep the advantage. Durant splashed a driving floater in the closing seconds of the half, as Houston went into the half with a 71-60 lead.\n\nAt the half, Eason led the team with 20 points including five three-pointers on just six shot attempts. Durant was the only other Rocket in double figures at the break, putting up 12 points.\n\nHouston came out of the locker room with a purpose, starting the second half on a 14-4 scoring run. Durant was consistently finding his spots and attacking the midrange, but he went to the bench after picking up his fourth whistle on a controversial offensive foul that was confirmed after a review.\n\nEven with KD off the floor for a chunk of the third, Houston stayed in the driver's seat and took a 103-77 lead into the final period.\n\nNursing such a comfortable lead, Houston sported a mixture of starters and bench players in the fourth quarter. Amen Thompson and Sengun got minutes, but Clint Capela, Josh Okogie and Reed Sheppard also saw some action.\n\nSheppard knocked down a pair of treys to make it a 120-91 ballgame, making the Toyota Center go crazy and triggering a Nets timeout.\n\nBoth teams fully emptied their benches down the stretch, and Houston gave some of their younger guys some game reps. At the final buzzer, the Rockets had secured a 137-109 win.\n\nThe win lifted the Rockets to 1-2 on the season, while the Nets fell to 0-4.\n\nNext up, the Rockets will hit the road to take on the Toronto Raptors on Oct. 29. Tip-off is scheduled for 5:30 p.m.",
        "source": {
          "uri": "click2houston.com",
          "dataType": "news",
          "title": "KPRC"
        },
        "authors": [
          {
            "uri": "michael_horton@click2houston.com",
            "name": "Michael Horton",
            "type": "author",
            "isAgency": false
          }
        ],
        "image": "https://res.cloudinary.com/graham-media-group/image/upload/f_auto/q_auto/c_thumb,w_700/v1/media/gmg/ZPDEKVXY6NHGXK7I7ZGIN65NJ4.jpg?_a=DATAg1eAZAA0",
        "eventUri": "eng-11089173",
        "sentiment": -0.05882352941176472,
        "wgt": 128,
        "relevance": 128
      },
      {
        "uri": "8926945805",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2025-10-27",
        "time": "05:42:12",
        "dateTime": "2025-10-27T05:42:12Z",
        "dateTimePub": "2025-10-27T05:40:37Z",
        "dataType": "news",
        "sim": 0.6352941393852234,
        "url": "https://www.straitstimes.com/sport/basketball/houston-rockets-trying-to-unleash-kevin-durant-brooklyn-nets-loving-their-fight",
        "title": "Houston Rockets trying to unleash Kevin Durant; Brooklyn Nets loving their \"fight\"",
        "body": "HOUSTON - There was little reason to expect the Houston Rockets' off-season addition of Kevin Durant to their line-up would yield a seamless transition, even given Durant's reputation as one of the premier scorers in NBA history and the Rockets' standing as one of the top teams in the Western Conference.\n\nRelatedly, after committing 25 turnovers in a season-opening loss to the Oklahoma City Thunder last Tuesday, the Rockets shot only 38.6 per cent in their 115-111 setback to the Detroit Pistons in their home opener on Friday.\n\nWith the Brooklyn Nets scheduled to visit Houston on Monday (Tuesday morning, Singapore time), the Rockets understand that they remain a work in progress despite lofty pre-season expectations.\n\nHouston have labored unleashing an efficient offensive attack. Their \"skyline' starting unit, the tallest since the NBA began tracking starting line-ups more than 50 years ago, has scuffled to generate the spacing needed to take full advantage of Durant's myriad skills.\n\nDurant scored a game-high 37 points against the Pistons, but the Rockets opened the second half with Josh Okogie on the court and 6-foot-7 wing Amen Thompson, their shortest starter, coming off the bench.\n\nOkogie provided a spark, and the Rockets found additional rhythm with Alperen Sengun playing as the lone big on the court during the third quarter. Despite their ability to utilize unique personnel groupings, the Rockets have yet to maximize the potential of their roster construction.\n\n\"It's always good having a versatile team, but knowing when to throw these different line-ups out there, that's the toughest job as a coach,\" Durant said. \"We'll be patient and keep growing and keep figuring things out.\n\n\"Our offence will get better.\"\n\nPutting Durant in a position to attack opposing defences with efficiency is the first order of business. The Rockets have yet to unlock the spacing needed for him to thrive in the halfcourt, while their early offensive pace has inhibited Thompson's exceptional athleticism.\n\n\"I think we're playing too upright,\" Rockets coach Ime Udoka said.\n\n\"That's going to be the formula this year is (for opponents) try to get up under guys. So you want to work on that and come off with some pace, whether it's pick- and-roll or off-ball actions. We haven't been great at that. Not just transition, but we'd like to play faster with more force in the halfcourt, for sure.\"\n\nMeanwhile, the Nets are in need of a win following three straight defeats.\n\nOn a Sunday when the San Antonio Spurs paid tribute to long-time coach Gregg Popovich, Victor Wembanyama made sure the unbeaten NBA club celebrated a victory as well.\n\nThe 2.24m French center scored 31 points, grabbed 14 rebounds, blocked six shots, passed off four assists and made three steals to spark the Spurs over Brooklyn 118-107.\n\nWembanyama has a combined 100 points and 18 blocked shots over the first three games of the regular season, a feat no other NBA player has ever managed.\n\n\"Nothing like winning,\" he said. \"It feels great. It feels like where we should be. It definitely gives a boost for motivation.\"\n\nIn another game, Austin Reaves exploded for a career-high 51 points, Deandre Ayton complemented 22 points with a game-high 15 rebounds and the Los Angeles Lakers, playing without injured stars Luka Doncic and LeBron James, downed the host Sacramento Kings 127-120. REUTERS, AFP",
        "source": {
          "uri": "straitstimes.com",
          "dataType": "news",
          "title": "The Straits Times"
        },
        "authors": [],
        "image": "https://cassette.sphdigital.com.sg/image/straitstimes/9e84fda8b46221ac31fb93a6cf4c53a125dde6f43e9d87dbcbac22efd884a276",
        "eventUri": "eng-11084379",
        "sentiment": 0.003921568627450966,
        "wgt": 128,
        "relevance": 128
      }
    ]
  },
  {
    "date": "2025-10-27",
    "home_team": "Los Angeles Lakers",
    "away_team": "Portland Trail Blazers",
    "home_points": 108,
    "away_points": 122,
    "score": "Los Angeles Lakers 108 - 122 Portland Trail Blazers",
    "winner": "Portland Trail Blazers",
    "articles": [
      {
        "uri": "8928722234",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2025-10-28",
        "time": "08:00:30",
        "dateTime": "2025-10-28T08:00:30Z",
        "dateTimePub": "2025-10-28T07:55:00Z",
        "dataType": "news",
        "sim": 0.47843137383461,
        "url": "https://www.oregonlive.com/blazers/2025/10/donovan-clingan-outplays-old-friend-deandre-ayton-as-trail-blazers-role-los-angeles-lakers.html",
        "title": "Donovan Clingan outplays old friend Deandre Ayton as Trail Blazers role Los Angeles Lakers",
        "body": "LOS ANGELES -- Deni Avdija had another 20-point night, Jrue Holiday drew praise from the opposing coach for his two-way dominance and the Portland Trail Blazers' incessant pressure wreaked havoc yet again.\n\nBut after watching his team dismiss the shorthanded Los Angeles Lakers Monday night at Crypto.com Arena, Blazers interim coach Tiago Splitter couldn't help but marvel at the performance of another player, a performance, he says, that stood out above all others.\n\n\"I think, lowkey, Donovan (Clingan) was great tonight,\" Splitter said after the Blazers breezed past the Lakers 122-108 to earn their first road win of the season. \"He protected the rim. He got seven offensive rebounds. He got a lot of second chances for us, (had) 14 rebounds total. He was awesome.\"\n\nThe superb play started almost immediately, 42 seconds after he outdueled old friend Deandre Ayton for the opening tip, when Clingan skied near the basket and swatted away Jake LaRavia's driving layup attempt off the glass. And it didn't let up the rest of the night, as the second-year center owned the glass, protected the paint, cleaned up teammates' misses and provided a last-line of defense for the Blazers' swarming full-court press.\n\nWhen it was all said and done, the 7-foot-2 bulldog had logged season highs in points (16), rebounds (14) and field goals (eight), while adding two blocks and two assists. He recorded his first double-double of the season, made 8 of 12 shots and finished with an impressive plus/minus of plus-21.\n\n\"If we didn't have DC, we'd be a very different team,\" Blazers forward Toumani Camara said. \"We just have a lot of trust in him, even though he's really young. And his ability to protect the rim and his competitive mindset, I think, is so important and really what I love about his game.\"\n\nLost in the Blazers' ludicrously fast pace of play, baseline-to-baseline defense, depth and recent off-the-court drama is that Clingan has quietly excelled through four games. After spending the offseason overhauling his physique and working to get in the best shape of his life -- all in an effort to survive the Blazers' new fast-paced schemes -- Clingan has enjoyed the spoils of his hard work.\n\nHe's averaging 11.8 points, 9.5 rebounds, 2.0 assists and 1.3 blocks per game.\n\nClingan's not the flashiest Blazers player, and he doesn't elicit the most highlight-reel moments. But ask around the Blazers' locker room, and Clingan's teammates will tell you his underrated contributions and general sacrifice have been invaluable.\n\n\"I think that he impacts our team and doesn't get credit for it,\" Holiday said. \"The way that he protects the paint. The way he controlled the paint and went at Ayton. He did it on the offensive end, getting offensive rebounds. And, defensively, we know Ayton can hit those shots, but when it gets to him trying to make buckets at the basket, I really feel like Cling really cleaned that up.\"\n\nAh, yes, Ayton.\n\nThat Clingan's best game of the season came against his old mentor, well, that was an added bonus. Clingan mostly downplayed the reunion, but after a little prodding, he finally acknowledged carrying a little extra juice into their first matchup as opponents.\n\nThere was no playful pregame trash talk via text, no friendly banter among old friends. They briefly said \"What's up?\" and exchanged a hug before the opening tip, then went to work.\n\nAyton finished with 16 points and eight rebounds, but he committed three turnovers, spent plenty of time in the first half complaining to officials about his early foul trouble and did most of his damage on midrange jumpers. For the most part, Clingan kept Ayton out of the lane and neutralized him whenever he managed to bully inside -- Ayton made just 2 of 5 shots in the paint.\n\nAfterward, Clingan praised the man who nurtured and tutored him throughout his rookie season, crediting Ayton for sharing wisdom about everything from rebound positioning to running the floor to communication.\n\nIt was just one of three times the former teammates will meet this season. But after outplaying his mentor in their first game as opponents, Clingan couldn't help but walk away from the visiting locker room at Crypto.com Arena wearing an oversized grin.\n\n\"I love DA,\" Clingan said. \"He helped me so much my rookie year getting me adapted to this game. And I've got a lot of respect for him and love for him. It was cool going out there playing against him tonight.\"",
        "source": {
          "uri": "oregonlive.com",
          "dataType": "news",
          "title": "Oregon Live"
        },
        "authors": [],
        "image": "https://www.oregonlive.com/resizer/v2/M4HTVGCRQRAFHJMM3MO4KCC6FY.jpg?auth=9d0250361f87efbbe3ae9a25b572b8332bb8b1d24412e93874a10dfc7e0c52bc&width=1280&smart=true&quality=90",
        "eventUri": "eng-11089044",
        "sentiment": 0.2156862745098038,
        "wgt": 177,
        "relevance": 177
      },
      {
        "uri": "8928548076",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2025-10-28",
        "time": "05:33:26",
        "dateTime": "2025-10-28T05:33:26Z",
        "dateTimePub": "2025-10-28T05:09:06Z",
        "dataType": "news",
        "sim": 0.5411764979362488,
        "url": "https://www.yakimaherald.com/ap/sports/trail-blazers-beat-lakers-122-108-despite-reaves-41-points/article_79e02d05-5876-5947-a51e-5de8a09f2915.html",
        "title": "Trail Blazers beat Lakers 122-108 despite Reaves' 41 points",
        "body": "LOS ANGELES (AP) -- Deni Avdija scored 25, Jrue Holiday had 24 points and six assists, and the Portland Trail Blazers pulled away from the short-handed Los Angeles Lakers 122-108 on Monday night.\n\nJerami Grant added 22 off the bench for the Blazers, who picked up their first road win of the season in the second game of a back-to-back after losing 114-107 at the Clippers on Sunday. Shaedon Sharpe and and Donovan Clingan chipped in with 16 apiece.\n\nAustin Reaves scored 41 points to follow up his career-high 51 in a 127-120 win at the Sacramento Kings on Sunday, but the rest of the depleted Lakers struggled to generate offense around him. Rui Hachimura and Deandre Ayton each had 16, and Jarred Vanderbilt scored 14.\n\nAlready missing two of their best players in Luka Doncic (sprained finger/leg bruise) and LeBron James (sciatica), the Lakers didn't have guards Marcus Smart (quadriceps contusion) and Gabe Vincent (sprained left ankle), leaving Reaves as the only experienced natural ball handler. Los Angeles had seven players unavailable in total.\n\nPortland's aggressive defense took advantage by forcing 25 turnovers, and the relentless pressure allowed the Blazers to pull away in the second half.\n\nLos Angeles magnified its ball security struggles with a poor showing from 3-point range, making 7 of 27 (25.9%). Avdija nearly matched that total himself, going 5 of 8 from long range, and Holiday (4 of 7) and Grant (3 of 7) weren't far off the pace.\n\nJump start your day.\n\nHeadlines, puzzles and death notices from the Valley delivered to your inbox 7 a.m. daily.\n\nSign Up Up next\n\nTrail Blazers: Wrap up a three-game road trip against the Jazz in Salt Lake City on Wednesday.\n\nLakers: Visit the Timberwolves in Minneapolis on Wednesday.\n\nAP NBA: https://apnews.com/hub/nba",
        "source": {
          "uri": "yakimaherald.com",
          "dataType": "news",
          "title": "Yakima Herald-Republic"
        },
        "authors": [
          {
            "uri": "associated_press@yakimaherald.com",
            "name": "Associated Press",
            "type": "author",
            "isAgency": true
          },
          {
            "uri": "dan_greenspan@yakimaherald.com",
            "name": "Dan Greenspan",
            "type": "author",
            "isAgency": false
          }
        ],
        "image": "https://bloximages.newyork1.vip.townnews.com/yakimaherald.com/content/tncms/assets/v3/editorial/8/c1/8c1b4923-256e-5345-a6ee-a61f20d4cbeb/690053546baf4.image.jpg?crop=1175%2C617%2C0%2C573&resize=438%2C230&order=crop%2Cresize",
        "eventUri": "eng-11085429",
        "sentiment": 0.1372549019607843,
        "wgt": 177,
        "relevance": 177
      },
      {
        "uri": "8928545221",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2025-10-28",
        "time": "05:30:09",
        "dateTime": "2025-10-28T05:30:09Z",
        "dateTimePub": "2025-10-27T22:29:00Z",
        "dataType": "news",
        "sim": 0.6745098233222961,
        "url": "https://www.dailynews.com/2025/10/27/depleted-lakers-fall-to-blazers-despite-austin-reaves-41-points/",
        "title": "Depleted Lakers fall to Blazers despite Austin Reaves' 41 points",
        "body": "LOS ANGELES -- The Lakers' roster went from short-handed to depleted within a day.\n\nBarely 24 hours removed from picking up a road win against the Sacramento Kings on Sunday night without five players, including stars Luka Doncic and LeBron James, the Lakers' task somehow became more challenging on Monday night: match up against a stingy Portland Trail Blazers team without all but one of their main ball handlers.\n\nWith veteran guards Marcus Smart and Gabe Vincent added to the injury report, the Lakers were left with fifth-year guard Austin Reaves as the lone ball-handler signed to the main roster available on Monday.\n\nAnd even though Reaves, who was fresh off scoring a career-high 51 points against the Kings, has shown multiple times he can lead the Lakers in these types of situations, the Blazers were too suffocating, handing the Lakers a 122-108 defeat at Crypto.com Arena.\n\nReaves led the way with 41 points on 13-of-22 shooting from the field (3 for 8 from 3-point range) for the third 40-point game of his NBA career to go with five assists and four rebounds. He went 12 for 14 at the free-throw line.\n\nBut Reaves also had eight of the Lakers' 25 turnovers, with the Blazers scoring 28 points off the Lakers' giveaways in addition to the 35 second-chance points Portland scored off of 19 offensive rebounds.\n\nThe Lakers (2-2) hung around for most of the first half, leading by as many as five in the opening quarter and having multiple leads in the second before trailing by six (57-51) at halftime.\n\nBut the visitors' physicality and intensity picked up coming out of the mid-game break.\n\nDeandre Ayton (16 points, eight rebounds) and Rui Hachimura (16 points, six assists) also scored in double figures for the Lakers. So did Jarred Vanderbilt, who finished with a season-high 14 points on 6-of-10 shooting to go with seven rebounds and three assists.\n\nSecond-year guard/forward Dalton Knecht scored 13 of the Lakers' 15 bench points before both teams emptied their benches with the Blazers leading 119-105 with 1:14 remaining.\n\nKnecht finished with 16 points on 5-of-13 shooting.\n\nPortland was led by Deni Avdija's 25 points, four assists, four rebounds and three blocked shots. Jrue Holiday finished with 24 points, six assists, five rebounds and two blocked shots.\n\nJerami Grant scored 22 points off the bench for the Blazers.",
        "source": {
          "uri": "dailynews.com",
          "dataType": "news",
          "title": "Daily News"
        },
        "authors": [
          {
            "uri": "khobi_price@dailynews.com",
            "name": "Khobi Price",
            "type": "author",
            "isAgency": false
          }
        ],
        "image": "https://www.dailynews.com/wp-content/uploads/2025/10/imageedit_3_4845125204.jpg?w=640",
        "eventUri": "eng-11085429",
        "sentiment": -0.1058823529411764,
        "wgt": 177,
        "relevance": 177
      }
    ]
  },
  {
    "date": "2025-10-27",
    "home_team": "Minnesota Timberwolves",
    "away_team": "Denver Nuggets",
    "home_points": 111,
    "away_points": 124,
    "score": "Minnesota Timberwolves 111 - 124 Denver Nuggets",
    "winner": "Denver Nuggets",
    "articles": [
      {
        "uri": "8928648670",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2025-10-28",
        "time": "07:04:10",
        "dateTime": "2025-10-28T07:04:10Z",
        "dateTimePub": "2025-10-28T06:58:50Z",
        "dataType": "news",
        "sim": 0.8039215803146362,
        "url": "https://www.denver7.com/sports/nuggets/murray-scores-43-points-jokic-has-triple-double-as-nuggets-beat-timberwolves-127-114",
        "title": "Murray scores 43 points, Jokic has triple-double as Nuggets beat Timberwolves 127-114",
        "body": "MINNEAPOLIS (AP) -- Jamal Murray scored 23 of his 43 points in the third quarter and Nikola Jokic had a triple-double as the Denver Nuggets beat the short-handed Minnesota Timberwolves 127-114 on Monday night.\n\nThe Timberwolves played without star guard Anthony Edwards, who will miss at least a week with a strained right hamstring after he was injured in Sunday's game against Indiana. Reserve guard Jaylen Clark also missed the game with left calf tightness.\n\nJokic finished with 25 points, 19 rebounds and 10 assists for his third triple-double in three games this season. He now has 167 career triple-doubles, third on the NBA's all-time list.\n\nMurray made 16 of 29 shots and hit five 3-pointers for the Nuggets, who outscored the Timberwolves 45-29 in the third quarter to overcome an eight-point halftime deficit.\n\nTim Hardaway Jr. scored 20 points and Peyton Watson added 12 for Denver.\n\nJaden McDaniels led Minnesota with 25 points, while Julius Randle scored 24 and Naz Reid had 18.\n\nMinnesota led 65-57 at halftime, but Murray opened the third quarter with five quick points on a jumper and a 3-pointer. His third 3 of the quarter put Denver on top 79-78. Hardaway hit a pair of 3s late in the quarter to stretch Denver's lead to 102-94 after three quarters.\n\nThe Timberwolves cut the lead to 104-101 but Watson answered with eight points in a 10-0 run including back-to-back corner 3s to restore the Nuggets' cushion.\n\nThe Nuggets lost all four of their regular-season games against Minnesota last year, but they clearly benefited from the absence of Edwards, who averaged 31.5 points per game against Denver last season.\n\nUp next\n\nDenver hosts New Orleans and the Timberwolves host the Lakers on Wednesday.\n\n___\n\nAP NBA: https://apnews.com/hub/nba\n\nMore from Denver7 Sports:\n\nDenver Nuggets\n\nNuggets Nation celebrates a win at home against the Phoenix Suns Maggy Wolanske\n\nDenver Nuggets\n\nJokic's triple-double lifts Nuggets over Suns 133-111 The Associated Press\n\nDenver Nuggets\n\nStephen Curry's 42 points lift Warriors over Nuggets in thrilling 137-131 OT win The Associated Press\n\nDenver7 Sports\n\nFormer Nugget Chauncey Billups, others arrested in FBI gambling investigation Justin Boggs\n\nDenver Nuggets\n\nChristian Braun agrees to $125M, 5-year extension with Denver Nuggets The Associated Press Next Page",
        "source": {
          "uri": "denver7.com",
          "dataType": "news",
          "title": "Denver 7 Colorado News (KMGH)"
        },
        "authors": [
          {
            "uri": "associated_press@denver7.com",
            "name": "Associated Press",
            "type": "author",
            "isAgency": false
          }
        ],
        "image": "https://ewscripps.brightspotcdn.com/dims4/default/45a440f/2147483647/strip/true/crop/4511x2537+0+0/resize/1200x675!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2Fa0%2F1b%2F730a509f4f0ca68912558b86a416%2Fap25301075134659.jpg",
        "eventUri": "eng-11088087",
        "sentiment": -0.1058823529411764,
        "wgt": 226,
        "relevance": 226
      }
    ]
  },
  {
    "date": "2025-10-27",
    "home_team": "New Orleans Pelicans",
    "away_team": "Boston Celtics",
    "home_points": 90,
    "away_points": 122,
    "score": "New Orleans Pelicans 90 - 122 Boston Celtics",
    "winner": "Boston Celtics",
    "articles": [
      {
        "uri": "8928429837",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2025-10-28",
        "time": "03:17:41",
        "dateTime": "2025-10-28T03:17:41Z",
        "dateTimePub": "2025-10-28T02:56:43Z",
        "dataType": "news",
        "sim": 0.6901960968971252,
        "url": "https://www.yakimaherald.com/ap/sports/simons-scores-25-points-as-the-celtics-earn-their-first-victory-by-beating-the-pelicans/article_57d46e00-155c-5639-a559-e329e5bb3353.html",
        "title": "Simons scores 25 points as the Celtics earn their first victory by beating the Pelicans 122-90",
        "body": "NEW ORLEANS (AP) -- Anfernee Simons made six 3-pointers and scored 25 points, and the Boston Celtics earned their first victory over the season by pulling away to beat the New Orleans Pelicans 122-90 on Monday night.\n\nPayton Pritchard added 18 points for the Celtics, who outscored the Pelicans 31-4 in the final 9:14 after they led by just five.\n\nSimons scored 12 in the fourth quarter for Boston, which had dropped its first three games. Luka Garza had 16 points, while Jaylen Brown and Josh Minott finished with 15 apiece.\n\nJordan Poole scored 22 points for the Pelicans, who played without Zion Williamson and fell to 0-3. Rookie Derik Queen had 12 points.\n\nWilliamson missed his first game of the season with a left foot bone bruise. He had scored 27 points in both of the first two games.\n\nPoole's 3-pointer cut it to 91-86 early in the fourth quarter before Simons made three 3-pointers and Sam Hauser had two in Boston's powerful finish.\n\nJump start your day.\n\nHeadlines, puzzles and death notices from the Valley delivered to your inbox 7 a.m. daily.\n\nSign Up Up next\n\nCeltics: Host Cleveland on Wednesday.\n\nPelicans: Visit Denver on Wednesday.\n\nAP NBA: https://apnews.com/hub/nba",
        "source": {
          "uri": "yakimaherald.com",
          "dataType": "news",
          "title": "Yakima Herald-Republic"
        },
        "authors": [
          {
            "uri": "associated_press@yakimaherald.com",
            "name": "Associated Press",
            "type": "author",
            "isAgency": true
          }
        ],
        "image": "https://bloximages.newyork1.vip.townnews.com/yakimaherald.com/content/tncms/assets/v3/editorial/7/cb/7cbc5890-8846-5280-acf4-5bc7c906b491/690033a48682f.image.jpg?crop=1760%2C924%2C0%2C126&resize=438%2C230&order=crop%2Cresize",
        "eventUri": "eng-11090052",
        "sentiment": 0.01960784313725483,
        "wgt": 226,
        "relevance": 226
      },
      {
        "uri": "8928428600",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2025-10-28",
        "time": "03:15:46",
        "dateTime": "2025-10-28T03:15:46Z",
        "dateTimePub": "2025-10-28T03:13:35Z",
        "dataType": "news",
        "sim": 0.6549019813537598,
        "url": "https://whdh.com/sports/simons-scores-25-points-as-the-celtics-earn-their-first-victory-by-beating-the-pelicans-122-90/",
        "title": "Simons scores 25 points as the Celtics earn their first victory by beating the Pelicans 122-90 - Boston News, Weather, Sports | WHDH 7News",
        "body": "NEW ORLEANS (AP) -- Anfernee Simons made six 3-pointers and scored 25 points, and the Boston Celtics earned their first victory over the season by pulling away to beat the New Orleans Pelicans 122-90 on Monday night.\n\nPayton Pritchard added 18 points for the Celtics, who outscored the Pelicans 31-4 in the final 9:14 after they led by just five.\n\nSimons scored 12 in the fourth quarter for Boston, which had dropped its first three games. Luka Garza had 16 points, while Jaylen Brown and Josh Minott finished with 15 apiece.\n\nJordan Poole scored 22 points for the Pelicans, who played without Zion Williamson and fell to 0-3. Rookie Derik Queen had 12 points.\n\nWilliamson missed his first game of the season with a left foot bone bruise. He had scored 27 points in both of the first two games.\n\nPoole's 3-pointer cut it to 91-86 early in the fourth quarter before Simons made three 3-pointers and Sam Hauser had two in Boston's powerful finish.\n\nUp next\n\nCeltics: Host Cleveland on Wednesday.\n\nPelicans: Visit Denver on Wednesday.\n\n(Copyright (c) 2025 The Associated Press. All Rights Reserved. This material may not be published, broadcast, rewritten, or redistributed.)\n\nJoin our Newsletter for the latest news right to your inbox Email address Submit",
        "source": {
          "uri": "whdh.com",
          "dataType": "news",
          "title": "WHDH 7 Boston"
        },
        "authors": [
          {
            "uri": "associated_press@whdh.com",
            "name": "Associated Press",
            "type": "author",
            "isAgency": true
          }
        ],
        "image": "https://whdh.com/wp-content/uploads/sites/3/2021/11/Celtics-v-New-Orleans-Pelicans.png",
        "eventUri": "eng-11090052",
        "sentiment": 0.01960784313725483,
        "wgt": 226,
        "relevance": 226
      }
    ]
  },
  {
    "date": "2025-10-27",
    "home_team": "Philadelphia 76ers",
    "away_team": "Orlando Magic",
    "home_points": 136,
    "away_points": 124,
    "score": "Philadelphia 76ers 136 - 124 Orlando Magic",
    "winner": "Philadelphia 76ers",
    "articles": [
      {
        "uri": "8928904717",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2025-10-28",
        "time": "10:03:54",
        "dateTime": "2025-10-28T10:03:54Z",
        "dateTimePub": "2025-10-28T10:00:33Z",
        "dataType": "news",
        "sim": 0.6784313917160034,
        "url": "https://www.nytimes.com/athletic/6755216/2025/10/28/76ers-move-to-3-0-are-putting-nightmare-of-last-season-behind-them/",
        "title": "76ers move to 3-0, are putting nightmare of last season behind them",
        "body": "PHILADELPHIA -- When a team with so much expectation for a season goes through 82 games and wins 24 of them, the next year can go a couple of ways. The spiral could continue. The frustration can linger. And almost everything can fall apart. Or maybe reinforcements can be made and lessons can be learned.\n\nEither way, the Philadelphia 76ers' nightmare of last season will be remembered by almost everyone who experienced it.\n\nThe Sixers don't want a repeat. The principal characters involved have made this clear since training camp. But that's what camp is for, to elicit hope. What speaks louder is how a team plays when the regular season begins.\n\nThe new 76ers are 3-0 after a rousing 136-124 win over the Orlando Magic on Monday. They are one of four unbeaten teams in the NBA and one of only two teams (including the Bulls) in the Eastern Conference without a loss. They've been an angry magnet of energy, led by MVP-level play from Tyrese Maxey and precocious rookie V.J. Edgecombe. They have fought and scrapped their way to three consecutive wins.\n\nWhen the Magic tried to punk them Monday, the Sixers made sure the bullies got bullied. When Desmond Bane fouled Maxey and stood over him, Maxey jumped to his feet and went nose to nose with Bane, the two players close enough to smell each other's breath.\n\nThat was Philadelphia forward Kelly Oubre, whose one sentence sums up how this team is feeling and the chip they are playing with. Outwardly, this roster is saying the right things. They know there will be adversity, there will be losses and there will be rough patches.\n\nBut the embarrassment of last season won't easily subside for this team. It's a proud and storied franchise. And the players know how important this season is, in terms of winning.\n\n\"We know that we are going to go through some things,\" Oubre said. \"But, it's how we respond that's going to determine what we end up being.\"\n\nPhiladelphia keeps passing the small tests that come its way. A regular-season opening win against the Boston Celtics proved the Sixers were capable of winning a possession game on the road. That win, and Saturday night's home-opening win over the Charlotte Hornets, proved the 76ers were capable of facing double-digit fourth-quarter deficits and rallying to win.\n\nMonday night was different, however. Against a Magic team fully loaded with bookend forwards Paolo Banchero and Franz Wagner, the Sixers won without Joel Embiid, Paul George, Jared McCain, Trendon Watford and Dominick Barlow. Last season, such an extensive injury list would have meant almost certain defeat. But this team is determined to roll with whomever is in uniform and expects to win.\n\nIt's a team that so far has been a stickler for small details. In the first half Monday, when rookie guard Hunter Sallis checked into an NBA game for the first time, he noticed Maxey yelling at him.\n\n\"Why are you yelling?\" Sallis asked.\n\n\"Your jersey is hanging out,\" Maxey responded. \"We don't want to get a technical foul, because you don't have your jersey tucked in.\"\n\nThat last response got Maxey to laugh. But the inference has been clear and from offseason conditioning to the beginning of training camp, and it has spilled over into the beginning of the season. The Sixers have done plenty of the things that stand out. Maxey has scored 40 or more twice. Edgecombe has been a revelation as a rookie. Oubre's 25 points and 10 rebounds prompted head coach Nick Nurse to say Monday night was perhaps his finest game in a 76ers uniform.\n\nBut the small things, the things that ultimately win games, the things that the Sixers didn't do a year ago, are the things that Philadelphia has done in spades so far.\n\n\"Kelly was awesome,\" Nurse said. \"He kept battling. He spent a lot of time guarding Banchero, and he was giving away about 50 pounds, maybe? He had a great game because he kept battling.\"\n\nOubre's game on Monday night served as a mirror for the 76ers as a group. Banchero and Wagner kept getting into the lane and scoring with ease. The Sixers were the smaller team. They started a two-way player in Jabari Walker at power forward. Sallis and veteran Eric Gordon saw their first minutes of the NBA season. Justin Edwards played a season-high 19 minutes. Quentin Grimes fouled out, and Philadelphia as a team had issues with fouling all night. Walker almost fouled out, too.\n\nAnd yet, the Sixers found a way. This is in part because Maxey has found another gear and may have taken a leap into another tier. And this is in part because Edgecombe has been a rare find as a rookie. Putting the two together, they have been one of the best backcourts in the league. Their ability to create offense and bend defenses has opened things for everyone else.\n\nOn Monday night, facing one of the best teams in the East, the Sixers looked to be at a real disadvantage, particularly without Embiid in the fold. As it turns out, the Sixers didn't need Embiid, at least on this night. Scoring 136 points without your superstar center isn't something to scoff at.\n\nAnd doing it against a team as highly regarded as the Magic is going to have to soften even some of the most dedicated skeptics.",
        "source": {
          "uri": "nytimes.com",
          "dataType": "news",
          "title": "The New York Times"
        },
        "authors": [
          {
            "uri": "tony_jones@nytimes.com",
            "name": "Tony Jones",
            "type": "author",
            "isAgency": false
          }
        ],
        "image": "https://static01.nyt.com/athletic/uploads/wp/2025/10/28013338/GettyImages-2243320241-scaled.jpg?width=1200&height=630&fit=cover",
        "eventUri": "eng-11085928",
        "sentiment": 0.1372549019607843,
        "wgt": 177,
        "relevance": 177
      },
      {
        "uri": "8928483794",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2025-10-28",
        "time": "04:21:57",
        "dateTime": "2025-10-28T04:21:57Z",
        "dateTimePub": "2025-10-28T03:55:04Z",
        "dataType": "news",
        "sim": 0.8784313797950745,
        "url": "https://www.thepeterboroughexaminer.com/sports/basketball/76ers-stay-undefeated-with-136-124-win-over-magic/article_24a28321-a7c6-537e-b374-efd4ac3c1b46.html",
        "title": "76ers stay undefeated with 136-124 win over Magic",
        "body": "PHILADELPHIA (AP) -- Tyrese Maxey scored 43 points, including eight straight during a crucial fourth-quarter stretch, and rookie VJ Edgecombe added 26 points as the Philadelphia 76ers beat the Orlando Magic 136-124 without Joel Embiid to improve to 3-0.\n\nEmbiid, the 2023 MVP and two-time scoring champ, was sidelined to rest his surgically repaired left knee. After playing in just 19 games last season, Embiid played the first two with a restriction of 20 minutes.\n\nPhiladelphia did just fine without its star center. Maxey followed a 3-pointer with a driving basket with just over a minute left that gave the 76ers a comfortable 12-point advantage. He is averaging 37.0 points per game. Edgecombe, the No. 3 pick in the NBA draft, continues to impress and has 75 points through three games. Kelly Oubre Jr. contributed 25 points.\n\nARTICLE CONTINUES BELOW\n\nPaolo Banchero had 32 points to pace the Magic, who opened a five-game, 10-day trip with their third consecutive loss. Desmond Bane chipped in with 24 points and Franz Wagner added 22.\n\nThe Sixers' Andre Drummond finished with six rebounds, becoming the 32nd player in NBA history to record at least 11,000 rebounds.\n\nCAVALIERS 116, PISTONS 95\n\nDETROIT (AP) -- Donovan Mitchell scored 35 points in just 29 minutes, and Cleveland beat Detroit for its third straight victory.\n\nThe Cavaliers had a 14-0 run in the second quarter that turned a seven-point lead into a 43-26 advantage and Mitchell's layup made it 63-41 at halftime. He scored 14 more in the third quarter and departed shortly after his basket made it 108-73 with 7:07 remaining.\n\nMitchell shot 13 of 18 from the field, including 2 for 4 from 3-point range, and went 7 for 8 from the free throw line. Jarrett Allen added 20 points and seven rebounds for the Cavaliers, while Evan Mobley finished with 15 points, 11 rebounds and five assists.\n\nCleveland beat Detroit for the 13th time in the last 14 meetings.\n\nCade Cunningham finished with 12 points for the Pistons, but shot 3 for 14 and committed five of their 25 turnovers. Ron Holland II and Tolu Smith each added 11 points.\n\nARTICLE CONTINUES BELOW ARTICLE CONTINUES BELOW\n\nROCKETS 137, NETS 109\n\nHOUSTON (AP) -- Tari Eason scored 22 points, Alperen Sengun added 21 points, six rebounds and six assists, and Houston beat Brooklyn for its first victory of the season.\n\nKevin Durant had 19 points against his former team, which fell to 0-4. Eason made five 3-pointers off the bench and fellow reserve Reed Sheppard added 15 points and eight assists.\n\nHouston lost in two overtimes against Oklahoma City in the NBA season opener and then fell by four against Detroit in its second game, but this one was never close.\n\nThe Rockets led 42-25 after shooting 62.5% in the first quarter, then outscored the Nets 32-17 in the third to extend an 11-point halftime lead to 103-77.\n\nThe lead grew to 33 points in the fourth quarter. Amen Thompson had 12 points and eight assists.\n\nTerance Mann scored 21 points and Michael Porter Jr. had 18 for the Nets.\n\nCELTICS 128, HAWKS 123\n\nNEW ORLEANS (AP) -- Anfernee Simons made six 3-pointers and scored 25 points, and Boston earned its first victory of the season by pulling away to beat New Orleans.\n\nARTICLE CONTINUES BELOW ARTICLE CONTINUES BELOW\n\nPayton Pritchard added 18 points for the Celtics, who outscored the Pelicans 31-4 in the final 9:14 after they led by just five.\n\nSimons scored 12 in the fourth quarter for Boston, which had dropped its first three games. Luka Garza had 16 points, while Jaylen Brown and Josh Minott finished with 15 apiece.\n\nJordan Poole scored 22 points for the Pelicans, who played without Zion Williamson and fell to 0-3. Rookie Derik Queen had 12 points.\n\nWilliamson missed his first game of the season with a left foot bone bruise. He had scored 27 points in both of the first two games.\n\nPoole's 3-pointer cut it to 91-86 early in the fourth quarter before Simons made three 3-pointers and Sam Hauser had two in Boston's powerful finish.\n\nBULLS 128, HAWKS 123\n\nCHICAGO (AP) -- Ayo Dosunmu scored 21 points, Josh Giddey had 18 points and 13 rebounds and Chicago rallied to top Atlanta.\n\nARTICLE CONTINUES BELOW ARTICLE CONTINUES BELOW\n\nNikola Vucevic had 17 points and 17 rebounds as Chicago came back from an early 13-point deficit to improved to 3-0, its best start in four years.\n\nKristaps Porzingis scored 27 points and Jalen Johnson 15 added in their return to the the Hawks lineup, but Atlanta dropped its second straight and the first of a four game trip to fall to 1-3.\n\nTrae Young had 21 points and 17 assists, including some flashy setups. Onyeka Okongwu added 18 points and 10 rebounds.\n\nEight Chicago players, including all five starers, reached double figures in scoring. Matas Buzelis had 16 points and Tre Jones added 14 with nine assists.\n\nSPURS 121, RAPTORS 103\n\nSAN ANTONIO (AP) -- Victor Wembanyama had 24 points and 15 rebounds, and San Antonio remained unbeaten with a victory over Toronto.\n\nSan Antonio is 4-0 for the first time since 2017.\n\nStephon Castle added 22 points and Harrison Barnes had 18 for San Antonio, which did not win its fourth game until Nov. 7 last season.\n\nARTICLE CONTINUES BELOW ARTICLE CONTINUES BELOW\n\nToronto lost its third straight after winning its season opener.\n\nR.J. Barrett had 25 points, Collin Murray-Boyles added 19 and Immanuel Quickley had 15 for the Raptors.\n\nWembanyama, who was named Western Conference player of the week earlier Monday, continued to dazzle spectators. He drove to the rim past Jakob Poeltl, made a 360-degree spin to avoid a charging Scottie Barnes and put the ball off the glass for a layup in the first half.\n\nWembanyama finished 7 of 8 from the field and was 10 for 10 on free throws.\n\nTHUNDER 101, MAVERICKS 94\n\nDALLAS (AP) -- Isaiah Hartenstein had 16 points and 12 points -- and scored Oklahoma City's only two field goals of the final 8:28 -- as it withstood a furious Dallas rally to win and improve to 4-0.\n\nShai Gilgeous-Alexander scored 23 points to lead the defending NBA champions. Chet Holmgren had 18 points, 11 rebounds and four blocks.\n\nAnthony Davis had 26 points and 11 rebounds for the Mavericks (1-3), playing their fourth straight home game to open the season.\n\nOklahoma City led 93-74 before Dallas went on a 13-0 run before Hartenstein's tip-in gave the Thunder a 95-89 lead with 2:52 to play. The Mavericks pulled within one point on a jumper by D'Angelo Russell with 54 seconds left, and Hartenstein answered with a left-handed layup with 33 seconds to play. Gilgeous-Alexander hit two free throws with 21.3 seconds left, and Holmgren added two more with 3.3 left.",
        "source": {
          "uri": "thepeterboroughexaminer.com",
          "dataType": "news",
          "title": "thepeterboroughexaminer.com"
        },
        "authors": [
          {
            "uri": "associated_press@thepeterboroughexaminer.com",
            "name": "Associated Press",
            "type": "author",
            "isAgency": false
          }
        ],
        "image": "https://bloximages.chicago2.vip.townnews.com/thepeterboroughexaminer.com/content/tncms/assets/v3/editorial/6/04/604b48db-a1b6-519f-97cf-7fb9a169e927/69004245e4434.image.jpg?crop=1620%2C851%2C0%2C114&resize=438%2C230&order=crop%2Cresize",
        "eventUri": "eng-11090948",
        "sentiment": 0.2313725490196079,
        "wgt": 177,
        "relevance": 177
      }
    ]
  },
  {
    "date": "2025-10-27",
    "home_team": "San Antonio Spurs",
    "away_team": "Toronto Raptors",
    "home_points": 121,
    "away_points": 101,
    "score": "San Antonio Spurs 121 - 101 Toronto Raptors",
    "winner": "San Antonio Spurs",
    "articles": [
      {
        "uri": "8928483846",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2025-10-28",
        "time": "04:23:43",
        "dateTime": "2025-10-28T04:23:43Z",
        "dateTimePub": "2025-10-28T04:21:34Z",
        "dataType": "news",
        "sim": 0.8039215803146362,
        "url": "https://www.thestar.com/sports/raptors/victor-wembanyama-and-the-spurs-move-to-4-0-with-a-121-103-win-over/article_f191cf31-8477-56cf-a6d0-08cc1393e413.html",
        "title": "Victor Wembanyama and the Spurs move to 4-0 with a 121-103 win over the Raptors",
        "body": "SAN ANTONIO (AP) -- Victor Wembanyama had 24 points and 15 rebounds, and the San Antonio Spurs defeated the Toronto Raptors 121-103 on Monday night to match the best start in franchise history.\n\nSan Antonio has opened a season 4-0 on four occasions, most recently in 2017, but the Spurs have never won their first five games.\n\nStephon Castle added 22 points and Harrison Barnes had 18 for San Antonio, which did not win its fourth game until Nov. 7 last season.\n\nARTICLE CONTINUES BELOW\n\nToronto lost its third straight after winning its season opener.\n\nR.J. Barrett had 25 points, Collin Murray-Boyles added 19 and Immanuel Quickley had 15 for the Raptors.\n\nWembanyama, who was named Western Conference player of the week earlier Monday, continued to dazzle spectators. He drove to the rim past Jakob Poeltl, made a 360-degree spin to avoid a charging Scottie Barnes and put the ball off the glass for a layup in the first half.\n\nWembanyama finished 7 of 8 from the field and was 10 for 10 on free throws.\n\nBarrett scored 10 points in the third quarter after protesting that he was fouled by Julian Champagnie on a blocked layup attempt in the opening minute of the second half.\n\nBarrett's dunk off a steal in the fourth quarter cut San Antonio's lead to 101-93 with 7:55 remaining, but Toronto couldn't get closer.\n\nWembanyama blocked Barrett's layup with 3:59 remaining for his 89th straight game with at least one blocked shot, breaking a tie with Patrick Ewing for the fourth-longest in league history. Ewing holds the record with 145 straight games with a block, followed by Atlanta's Dikembe Mutombo (116) and Utah's Mark Eaton (94).\n\nSan Antonio had six players score in double figures and won its fourth straight against Toronto.\n\nARTICLE CONTINUES BELOW ARTICLE CONTINUES BELOW\n\nDylan Harper had 11 points to join Wembanyama, David Robinson and Willie Anderson as the only rookies in Spurs history to score in double figures in their first four games.\n\nUp next\n\nRaptors: Host Houston on Wednesday.\n\nSpurs: Host Miami on Thursday.\n\n___\n\nAP NBA: https://apnews.com/hub/nba\n\nSports Headlines Follow every exhilarating win and heartbreaking loss with our Sports Headlines newsletter\n\nError! Sorry, there was an error processing your request.\n\nThere was a problem with the recaptcha. Please try again.\n\nPlease enter a valid email address. Sign Up This newsletter is only available for subscribers. If you are already a subscriber, please login now. If you want to become subscriber, please click here Yes, I'd also like to receive customized content suggestions and promotional messages from the Star.\n\nYou may unsubscribe at any time. By signing up, you agree to our terms of use and privacy policy. This site is protected by reCAPTCHA and the Google privacy policy and terms of service apply.\n\nSports Headlines You're signed up! You'll start getting Sports Headlines in your inbox soon.\n\nWant more of the latest from us? Sign up for more at our newsletter page.",
        "source": {
          "uri": "thestar.com",
          "dataType": "news",
          "title": "The Star"
        },
        "authors": [],
        "image": "https://bloximages.chicago2.vip.townnews.com/thestar.com/content/tncms/assets/v3/editorial/b/59/b59997dd-a86a-55ce-95f6-1388850245dc/69003424358c8.image.jpg?crop=1620%2C851%2C0%2C114&resize=438%2C230&order=crop%2Cresize",
        "eventUri": "eng-11090107",
        "sentiment": -0.1137254901960785,
        "wgt": 226,
        "relevance": 226
      },
      {
        "uri": "8928445725",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2025-10-28",
        "time": "03:39:14",
        "dateTime": "2025-10-28T03:39:14Z",
        "dateTimePub": "2025-10-28T03:38:10Z",
        "dataType": "news",
        "sim": 0.729411780834198,
        "url": "https://www.thestar.com/sports/raptors/wembanyama-helps-spurs-move-to-4-0-with-121-103-win-over-raptors/article_f191cf31-8477-56cf-a6d0-08cc1393e413.html",
        "title": "Wembanyama helps Spurs move to 4-0 with 121-103 win over Raptors",
        "body": "SAN ANTONIO (AP) -- Victor Wembanyama had 24 points and 15 rebounds, and the San Antonio Spurs remained unbeaten with a 121-103 victory over the Toronto Raptors on Monday night.\n\nSan Antonio is 4-0 for the first time since 2017.\n\nStephon Castle added 22 points and Harrison Barnes had 18 for San Antonio, which did not win its fourth game until Nov. 7 last season.\n\nToronto lost its third straight after winning its season opener.\n\nR.J. Barrett had 25 points, Collin Murray-Boyles added 19 and Immanuel Quickley had 15 for the Raptors.\n\nARTICLE CONTINUES BELOW\n\nWembanyama, who was named Western Conference player of the week earlier Monday, continued to dazzle spectators. He drove to the rim past Jakob Poeltl, made a 360-degree spin to avoid a charging Scottie Barnes and put the ball off the glass for a layup in the first half.\n\nWembanyama finished 7-of-8 from the field and was 10-for-10 on free throws.\n\nBarrett scored 10 points in the third quarter after protesting that he was fouled by Julian Champagnie on a blocked layup attempt in the opening minute of the second half.\n\nBarrett's dunk off a steal in the fourth quarter cut San Antonio's lead to 101-93 with 7:55 remaining, but Toronto couldn't get closer.\n\nWembanyama blocked Barrett's layup with 3:59 remaining for his 89th straight game with at least one blocked shot, breaking a tie with Patrick Ewing for the fourth-longest in league history. Ewing holds the record with 145 straight games with a block, followed by Atlanta's Dikembe Mutombo (116) and Utah's Mark Eaton (94).\n\nSan Antonio had six players score in double figures and won its fourth straight against Toronto. With both teams playing the second night of back-to-back games, the Spurs opened a double-digit lead in the first quarter.\n\nUP NEXT\n\nRaptors: Host the Houston Rockets on Wednesday.\n\nSpurs: Host the Miami Heat on Thursday.\n\n___\n\nAP NBA: https://apnews.com/hub/nba\n\nSports Headlines Follow every exhilarating win and heartbreaking loss with our Sports Headlines newsletter\n\nError! Sorry, there was an error processing your request.\n\nThere was a problem with the recaptcha. Please try again.\n\nPlease enter a valid email address. Sign Up This newsletter is only available for subscribers. If you are already a subscriber, please login now. If you want to become subscriber, please click here Yes, I'd also like to receive customized content suggestions and promotional messages from the Star.\n\nYou may unsubscribe at any time. By signing up, you agree to our terms of use and privacy policy. This site is protected by reCAPTCHA and the Google privacy policy and terms of service apply.\n\nSports Headlines You're signed up! You'll start getting Sports Headlines in your inbox soon.\n\nWant more of the latest from us? Sign up for more at our newsletter page.",
        "source": {
          "uri": "thestar.com",
          "dataType": "news",
          "title": "The Star"
        },
        "authors": [],
        "image": "https://bloximages.chicago2.vip.townnews.com/thestar.com/content/tncms/assets/v3/editorial/b/59/b59997dd-a86a-55ce-95f6-1388850245dc/69003424358c8.image.jpg?crop=1620%2C851%2C0%2C114&resize=438%2C230&order=crop%2Cresize",
        "eventUri": "eng-11090107",
        "sentiment": -0.08235294117647063,
        "wgt": 201,
        "relevance": 201
      },
      {
        "uri": "8927465643",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2025-10-27",
        "time": "12:03:39",
        "dateTime": "2025-10-27T12:03:39Z",
        "dateTimePub": "2025-10-27T12:00:41Z",
        "dataType": "news",
        "sim": 0.8039215803146362,
        "url": "https://www.nytimes.com/athletic/6753213/2025/10/27/mavericks-cooper-flagg-first-nba-win/",
        "title": "Mavericks' Cooper Flagg 'feels great' after notching first NBA win",
        "body": "DALLAS -- In his first week in the NBA, Cooper Flagg experienced something unfamiliar: a losing streak.\n\nThe Dallas Mavericks dropped their season opener to the San Antonio Spurs on Wednesday. Two nights later, they lost again to the Washington Wizards.\n\nIn Flagg's one-and-done season at Duke, the Blue Devils went 35-4. The year before that, Flagg led Montverde Academy to a 34-0 record in his final year of high school.\n\nSunday, Flagg got back to his winning ways, as the Mavericks beat the Toronto Raptors 139-129 at American Airlines Center. Flagg scored 22 points, grabbed four rebounds and dished four assists as Dallas' offense showed signs of life after two poor showings to begin the season.\n\n\"Feels great,\" Flagg said about earning his first win as an NBA player. \"Got our first win tonight at home. That's big for us. We want to build off tonight and use it as a baseline and keep building.\"\n\nThe Mavericks trailed the Raptors by 2 points at halftime. Dallas had 12 turnovers at the break, with its ball-security issues from the San Antonio and Washington games persisting.\n\nIn the third quarter, Dallas took control of the game by ramping up its defensive intensity and out-running Toronto in transition. Dallas closed the quarter on a 21-6 run. The highlight of that decisive stretch was Flagg's poster dunk over Sandro Mamukelashvili.\n\nMavericks guard D'Angelo Russell threw the ball ahead to a streaking Flagg, who needed only one dribble from half court to get close enough to the rim to dunk. Flagg celebrated his and-1 by chest-bumping Anthony Davis.\n\n\"It was unbelievable,\" Russell said. \"He does a little bit of everything. When he's getting the crowd going like that, the team feeds on that. When he's performing like that, it's contagious.\"\n\nRussell played an important role in the win as well. He missed his first seven shots yet still managed to score 24 points, collect five rebounds and hand out six assists. The Mavericks outscored the Raptors by 26 points with him on the floor. He played 29 minutes, which was five more than he played in the first two games of the season combined.\n\n\"Coaches' experiment,\" Russell said. \"Just trying to be ready. You never know when your number is going to be called. But if you get distracted, you won't be ready. So just stay ready.\"\n\nMavericks coach Jason Kidd continued to use a starting lineup without a traditional point guard. Flagg started next to Davis, Klay Thompson, P.J. Washington and Dereck Lively II for a third consecutive game. It doesn't sound as though Kidd plans to deviate from that starting lineup anytime soon. However, he did make a significant change by getting Russell into the game for longer stretches.\n\n\"That was D-Lo,\" Flagg said. \"He showed up in a big way. Came out. Soon as he got in there, just had a high impact on the game -- drew fouls, scoring, running the offense, getting us set up, organized. That was big for him. Just coming through and being that vet.\"\n\nThe Mavericks have a 1-2 record. Two games remain on their homestand. Flagg will get another chance to win in front of the American Airlines Center crowd Monday, when the Mavericks host the defending champion Oklahoma City Thunder.\n\n\"The fans have showed up for the first three games,\" Flagg said. \"I thought tonight was really the first time we gave them something to be excited for and be on their feet for. That was really good. A great step for us moving forward.\"",
        "source": {
          "uri": "nytimes.com",
          "dataType": "news",
          "title": "The New York Times"
        },
        "authors": [
          {
            "uri": "christian_clark@nytimes.com",
            "name": "Christian Clark",
            "type": "author",
            "isAgency": false
          }
        ],
        "image": "https://static01.nyt.com/athletic/uploads/wp/2025/10/27011335/GettyImages-2243521733-scaled-e1761542958182.jpg?width=1200&height=630&fit=cover",
        "eventUri": "eng-11083409",
        "sentiment": 0.003921568627450966,
        "wgt": 177,
        "relevance": 177
      }
    ]
  },
  {
    "date": "2025-10-27",
    "home_team": "Utah Jazz",
    "away_team": "Phoenix Suns",
    "home_points": 138,
    "away_points": 134,
    "score": "Utah Jazz 138 - 134 Phoenix Suns",
    "winner": "Utah Jazz",
    "articles": [
      {
        "uri": "8928645600",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2025-10-28",
        "time": "07:01:43",
        "dateTime": "2025-10-28T07:01:43Z",
        "dateTimePub": "2025-10-28T05:37:49Z",
        "dataType": "news",
        "sim": 0.7019608020782471,
        "url": "https://ksltv.com/ksltvsports/kslsports-feed/lauri-markkanen-scores-51-jazz-beat-suns-in-ot/837691/",
        "title": "Lauri Markkanen Scores 51, Jazz Beat Suns In OT",
        "body": "SALT LAKE CITY -- Lauri Markkanen scored a career-high 51 points to lead the Utah Jazz past the Phoenix Suns 138-124 in overtime.\n\nPhoenix forced overtime with a miraculous comeback, erasing a seven-point deficit in the final 23 seconds of regulation. But the Suns couldn't slow Markkanen, who dominated down the stretch.\n\nMarkkanen recorded the most points by a Jazz player in a regular-season game since Karl Malone scored 56 in 1998.\n\nMarkkanen delivered the performance of the night, stepping up in clutch moments. After a quiet finish in Friday's loss to the Sacramento Kings, he took control late, scoring 20 points in the fourth quarter and overtime. He used his physical advantages to overpower a smaller Suns lineup.\n\n\"You try to be as effective as you can for a team, but you never know if it's going to happen or not, but I'm happy it did,\" Markkanen said. \"I always credit my teammates; they always put me in great positions, and you've just got to knock down shots and stay aggressive.\"\n\nMarkkanen struggled during the 2024-25 season but rebounded by leading Finland to the EuroBasket final four over the summer. He has carried that momentum into Utah's season.\n\nWith John Collins, Collin Sexton, and Jordan Clarkson departing in the offseason, the Jazz leaned on Markkanen to take on a larger offensive role -- and he has exceeded expectations.\n\nIn addition to his 51 points, Markkanen added 14 rebounds and three assists while shooting 14-of-32 from the floor in 45 minutes.\n\nWalker Kessler also made key plays late, scoring seven points in the fourth quarter and blocking two shots in the final minute of overtime to help seal the win.\n\nRelated: Walker Kessler Admits Frustration With No Contract Extension\n\nKessler hit 6-of-7 free throws and improved to 13-of-17 on the season, raising his free-throw percentage to 76. He entered the season as a career 54 percent shooter from the line and has shown significant improvement.\n\n\"I just worked on it a lot,\" Kessler said of his free throws. \"Better touch, more confidence going to the line, [I'm] trying to get fouled more.\"\n\nThe fourth-year center finished with 25 points, 11 rebounds, four assists, and four blocks in 35 minutes.\n\nKeyonte George has emerged as one of the season's biggest surprises, providing consistent and steady play at point guard. Through three games, the third-year guard has averaged 20 points and 9.6 assists, showing signs of becoming a true NBA-caliber floor general.\n\nWhile still a scoring threat, George has developed a more mature approach to running the offense and elevating his teammates.\n\n\"He's gained so much respect from all of his teammates because of his work ethic,\" head coach Will Hardy said. \"He's taken a lot of hard coaching. We've had a lot of very honest conversations. I'll probably say it 100 more times this year, but I'm really proud of that kid.\"\n\nGeorge finished with 26 points, 10 assists and five rebounds in 43 minutes.\n\nAce Bailey's first week in the NBA hasn't gone as planned.\n\nAfter impressing in his first two preseason games, the fifth-overall pick was sidelined with knee tendinopathy. He then caught an illness that lingered for nearly a week, leading up to opening night.\n\nIn his first two regular-season games, Bailey played under a minutes restriction-likely coming off the bench for the first time in his esteemed career-and struggled to find rhythm in limited action.\n\nBailey scored just two points on 1-of-10 shooting in those two games, a stark contrast to the 22.5 points per game he averaged in his two full preseason performances.\n\nDespite the setbacks, Hardy praised Bailey's resilience.\n\n\"He seems to be the same Ace that he was the first day in terms of his spirit and mood,\" Hardy said. \"It's been an adjustment for him for sure. The timing of getting sick wasn't ideal, because he had shown in a couple of preseason games his overall skill set, and everybody was pretty excited, him included.\"\n\nAgainst the Suns, Bailey again saw limited minutes, recording six points, one rebound, and one assist in just 14 minutes.\n\n\"It's a long road -- 82 games is a long time,\" Hardy concluded. \"Ace is also at the very beginning of what hopes to be a really long career.\"\n\nThe Jazz will host the Portland Trail Blazers on Wednesday at 7 p.m. MST. The game will be televised on KJZZ, streamed on Jazz+, and heard on 97.5 The KSL Sports Zone.\n\nAre you on Threads yet? Let's connect, give us a follow @kslsports.",
        "source": {
          "uri": "ksltv.com",
          "dataType": "news",
          "title": "KSLTV.com"
        },
        "authors": [],
        "image": "https://ksltv.com/wp-content/uploads/2025/10/1027jazzspt_KM_2547.jpg",
        "eventUri": "eng-11090522",
        "sentiment": -0.05098039215686279,
        "wgt": 128,
        "relevance": 128
      },
      {
        "uri": "8928554086",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2025-10-28",
        "time": "05:39:27",
        "dateTime": "2025-10-28T05:39:27Z",
        "dateTimePub": "2025-10-28T05:36:23Z",
        "dataType": "news",
        "sim": 0.7176470756530762,
        "url": "https://www.sportsnet.ca/nba/article/markkanen-becomes-first-jazz-player-to-top-50-points-since-karl-malone/",
        "title": "Markkanen becomes first Jazz player to top 50 points since Karl Malone",
        "body": "SALT LAKE CITY -- The Utah Jazz played 2,155 regular-season games since Karl Malone scored 56 points in a win over Golden State on April 7, 1998.\n\nNo Jazz player had topped the 50-point mark until Lauri Markkanen scored a career-high 51 in a 138-134 win over the Phoenix Suns on Monday night. He became the 97th player to score 50 points in NBA history.\n\nThe Jazz needed all of them, including the Finnish star's two free throws with 1.9 left in overtime, to clinch the win.\n\nMarkkanen played 45 minutes and became the focus of the Suns' defensive efforts but said he wasn't tired as he headed to the free-throw line.\n\n\"As long as you're mentally not tired, and kind of force yourself out of that mindset that you're tired, and then you can push through whatever you need to,\" Markkanen said.\n\nIt's that mental aspect that Markkanen has improved steadily through his nine-year career and believes he's never played better.\n\n\"The game is slower now,\" Markkanen said. \"You get hungrier as it happens, so hopefully it's not the last.\"\n\nMarkkanen made six 3s and went 17 for 17 from the line in achieving a mark he'd never planned to reach. \"I never think about, I'm going to go for 50 but obviously, when it's overtime, and you're at 47 and they start fouling, you start think there's a there's a good chance that it's going to happen,\" said Markkanen, who also grabbed 14 rebounds.\n\nKeyonte George, who added 26 points and 10 assists, knew Markkanen had it going and was looking for his teammate whenever he could.\n\n\"Just wanted to get it to Lauri in space. Just putting the ball in our play makers' hands and let them be themselves,\" George said. \"We are empowering him more.\"\n\nMarkkanen was happy with his achievement, but said he wished he would have made his baseline jumper at the end of regulation that rimmed out (and would have given him 46 points).\n\nIn either case, Markannen was the difference for this young Jazz team.\n\n\"He showed a tremendous amount of heart. He was really physical tonight and made a lot of big baskets,\" Utah coach Will Hardy said.",
        "source": {
          "uri": "sportsnet.ca",
          "dataType": "news",
          "title": "Sportsnet"
        },
        "authors": [
          {
            "uri": "associated_press@sportsnet.ca",
            "name": "Associated Press",
            "type": "author",
            "isAgency": true
          }
        ],
        "image": "https://www.sportsnet.ca/wp-content/uploads/2025/10/c38a1beae9666dbcdde1bf6a8f6731f36d49ea4b1f4da963b3f91f9465c6b5e7.jpg",
        "eventUri": "eng-11090522",
        "sentiment": 0.2784313725490195,
        "wgt": 128,
        "relevance": 128
      },
      {
        "uri": "8928542899",
        "lang": "eng",
        "isDuplicate": false,
        "date": "2025-10-28",
        "time": "05:27:07",
        "dateTime": "2025-10-28T05:27:07Z",
        "dateTimePub": "2025-10-28T05:17:05Z",
        "dataType": "news",
        "sim": 0.6901960968971252,
        "url": "https://www.clickorlando.com/sports/2025/10/28/markkanen-becomes-first-jazz-player-to-top-50-points-since-karl-malone-in-win-over-suns/",
        "title": "Markkanen becomes first Jazz player to top 50 points since Karl Malone in win over Suns",
        "body": "SALT LAKE CITY - The Utah Jazz played 2,155 regular season games since Karl Malone scored 56 points in awin over Golden State on April 7, 1998.\n\nNo Jazz player had topped the 50-point mark until Lauri Markkanen scored a career-high 51 in a 138-134 win over the Phoenix Suns on Monday night. He became the 97th player to score 50 points in NBA history.\n\nRecommended Videos\n\nThe Jazz needed all of them, including the Finnish star's two free throws with 1.9 left in overtime, to clinch the win.\n\nMarkkanen played 45 minutes and became the focus of the Suns' defensive efforts but said he wasn't tired as he headed to the free-throw line.\n\n\"As long as you're mentally not tired, and kind of force yourself out of that mindset that you're tired, and then you can push through whatever you need to,\" Markkanen said.\n\nIt's that mental aspect that Markkanen has improved steadily through his nine-year career and believes he's never played better.\n\n\"The game is slower now,\" Markkanen said. \"You get hungrier as it happens, so hopefully it's not the last.\"\n\nMarkkanen made six 3s and went 17 for 17 from the line in achieving a mark he'd never planned to reach. \"I never think about, I'm going to go for 50 but obviously, when it's overtime, and you're at 47 and they start fouling, you start think there's a there's a good chance that it's going to happen,\" said Markkanen, who also grabbed 14 rebounds.\n\nKeyonte George, who added 26 points and 10 assists, knew Markkanen had it going and was looking for his teammate whenever he could.\n\n\"Just wanted to get it to Lauri in space. Just putting the ball in our play makers' hands and let them be themselves,\" George said. \"We are empowering him more.\"\n\nMarkkanen was happy with his achievement, but said he wished he would have made his baseline jumper at the end of regulation that rimmed out (and would have given him 46 points).\n\nIn either case, Markannen was the difference for this young Jazz team.\n\n\"He showed a tremendous amount of heart. He was really physical tonight and made a lot of big baskets,\" Utah coach Will Hardy said.\n\n___\n\nAP NBA: https://www.apnews.com/hub/NBA",
        "source": {
          "uri": "clickorlando.com",
          "dataType": "news",
          "title": "WKMG"
        },
        "authors": [
          {
            "uri": "associated_press@clickorlando.com",
            "name": "Associated Press",
            "type": "author",
            "isAgency": true
          }
        ],
        "image": "https://res.cloudinary.com/graham-media-group/image/upload/f_auto/q_auto/c_thumb,w_700/v1/media/gmg/CH7VN4CJEJENFGUGYL7AR2RZOQ.jpg?_a=DATAg1eAZAA0",
        "eventUri": "eng-11090522",
        "sentiment": 0.2470588235294118,
        "wgt": 128,
        "relevance": 128
      }
    ]
  }
]